[
    {
        "content": "<p>Hi Everyone:<br>\nI hope you've been enjoying summer!</p>\n<p>I'm reaching out to schedule monthly meeting for this working group, starting in September. </p>\n<p>As per Ceilyn's last post in July,  Harvard Dataverse has a list of requests for large data support, our largest at the moment being close to 500TB.  We have worked on intake forms, budget planners, Globus/NESE download instructions, and thinking about how to move forward as larger support requests come our way. It would be nice to catch up and see how your Institutions are managing this feature and share our learned experiences to improve all of these process.</p>\n<p>Let's get started by finding a good monthly day/time to meet. Please complete this doodle poll with your monthly meeting preference by <strong>this Friday</strong>: <a href=\"http://url\">https://doodle.com/meeting/participate/id/bWm6MWne</a></p>\n<p>Select the date and time based on <strong><em>your monthly availability.</em></strong></p>\n<p>I look forward to seeing you all in September.</p>\n<p>Cheers<br>\nSonia</p>",
        "id": 460117810,
        "sender_full_name": "Sonia Barbosa",
        "timestamp": 1723480178
    },
    {
        "content": "<p>Hey Large Data Folks, If you'd like to join a webinar on this service, contact me for the zoom link:</p>\n<p>The Open Storage Network (OSN), funded by the NSF, the Schmidt Futures Foundation, and Dalio Philanthropies, has developed a storage platform to support scientific and scholarly production using cost-effective, performant systems connected at high speeds via Internet2. The OSN provides an industry-standard cyberinfrastructure (CI) service using open-source software to address specific data storage, transfer, sharing, and access challenges by providing object storage as a service. While initially designed as “just” a low-friction data-sharing platform, projects and organizations are starting to deploy services on top of OSN as part of their more extensive CI plans. We now allow Universities, Non-Profit Organizations, and Government labs to purchase their own OSN appliance, which we then support. Over the last few years, six separate organizations have used OSN as the solution for their winning NSF CC* Data Storage proposals.</p>\n<p>When: <strong>Aug 20, 2024, 12:00 PM Pacific Time (US and Canada)</strong><br>\nTopic: The Open Storage Network as a Storage Solution for NSF CC* and Other Program Solicitations</p>\n<p>Thanks</p>",
        "id": 462213694,
        "sender_full_name": "Sonia Barbosa",
        "timestamp": 1723583727
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"707680\">@Sonia Barbosa</span>  When is the webinar? If I can make it, I would like to join.</p>",
        "id": 462345486,
        "sender_full_name": "Sherry Lake",
        "timestamp": 1723641700
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"599826\">Sherry Lake</span> <a href=\"#narrow/stream/432390-large-data/topic/hello.20-.20scheduling.20monthly.20meetings/near/462345486\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"707680\">Sonia Barbosa</span>  When is the webinar? If I can make it, I would like to join.</p>\n</blockquote>\n<p>When: <strong>Aug 20, 2024, 12:00 PM Pacific Time (US and Canada)</strong><br>\nTopic: The Open Storage Network as a Storage Solution for NSF CC* and Other Program Solicitations</p>",
        "id": 462348171,
        "sender_full_name": "Sonia Barbosa",
        "timestamp": 1723642672
    }
]