[
    {
        "content": "<p>Hi there .. wondering if someone could answer whether DVWebloader uses direct upload to upload files via the UI? I believe it is using the API vs UI but does it utilize the presigned URLs and file-chunking for large files that dvuploader does? I was under the impression that it does, and it doesn't even show up in the UI unless you have direct upload enabled, but is it still limited as far as upload size ability? It seems to indicate that it does <a href=\"https://guides.dataverse.org/en/latest/developers/big-data-support.html#allow-cors-for-s3-buckets\">here</a> but I could interpret that other ways, too.</p>",
        "id": 568300198,
        "sender_full_name": "Deirdre Kirmis",
        "timestamp": 1768507030
    },
    {
        "content": "<p>ie: i thought we could use it to upload very large files as we can with dvuploader, but just from the UI</p>",
        "id": 568300890,
        "sender_full_name": "Deirdre Kirmis",
        "timestamp": 1768507277
    },
    {
        "content": "<p>I'm pretty sure dvwebloader uses direct upload but if you want a more definitive answer, please email the google group and Jim will likely respond.</p>",
        "id": 568311178,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1768510945
    },
    {
        "content": "<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 568317708,
        "sender_full_name": "Deirdre Kirmis",
        "timestamp": 1768514020
    },
    {
        "content": "<p>AFAIK dvwebloader is indeed depending on the feature of S3 direct uploads. There's that pipedream of mine where we implement <a href=\"http://tus.io\">tus.io</a> in the backend, so we can also have dvwebloader use that if you don't have S3 direct upload available...</p>",
        "id": 568433971,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1768570112
    },
    {
        "content": "<p>Great! Yea I thought it used direct upload because I'm pretty sure we've used it for very large uploads in the past, but we ran into an error with it yesterday .. I thought that was because we were trying to upload files that were too large, but it may be related to a bug related to CORS-handling. Glad to know we have this tool for those large uploads .. it is immensely helpful!</p>",
        "id": 568448275,
        "sender_full_name": "Deirdre Kirmis",
        "timestamp": 1768573983
    }
]