[
    {
        "content": "<p>Hello there!<br>\nFollowing <a href=\"#narrow/stream/378866-troubleshooting/topic/Not.20seeing.20.22Create.20URL.20for.20Anonymized.20Access.22.20option\">this discussion</a>, Philip and I figured it would be good to indicate in the User (or sometimes Admin) guide, when a feature that is documented there is not enabled by default.<br>\nHere is <a href=\"https://github.com/IQSS/dataverse/issues/10717\">the issue</a> to review the proposed text of the note that could be added, and list the features where it would be needed.</p>",
        "id": 453698865,
        "sender_full_name": "Dimitri Szabo",
        "timestamp": 1721828358
    },
    {
        "content": "<p>Yes, thanks, Dimitri. If anyone wants to work on this, I'm happy to help them get started!</p>",
        "id": 453702132,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1721829143
    },
    {
        "content": "<p>Embargo is a big one. At least it starts with \"A Dataverse instance may be configured to support file-level embargoes\" to give a clue that it might not be turned on.</p>",
        "id": 453716538,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1721832739
    },
    {
        "content": "<p>I've heard from some folks running installations that one reason they've created their own documentation, instead of pointing to the guides at <a href=\"https://guides.dataverse.org\">https://guides.dataverse.org</a>, is to mention only features enabled in their installation. I'm just mentioning this to add broader context here. I agree it's a good idea to be more explicit in the default Dataverse guides about which features a particular installation may or may not have.</p>",
        "id": 453725276,
        "sender_full_name": "Julian Gautier",
        "timestamp": 1721834528
    },
    {
        "content": "<p>Yeah, good point.</p>",
        "id": 453725413,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1721834567
    },
    {
        "content": "<p>Also, historically, we had a rule that we don't link from the User Guide to other guides so as not to confuse the user. However, the champion of that idea is long gone and now we freely link between any guides.</p>",
        "id": 453725571,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1721834611
    },
    {
        "content": "<p>Here's an example for our custom guide: <a href=\"https://data.fz-juelich.de/guide/juelich/index.html\">https://data.fz-juelich.de/guide/juelich/index.html</a></p>",
        "id": 453983841,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1721922491
    },
    {
        "content": "<p>But to be fair: it's not a complete fork of the guides - we did not apply patches, just an extra section.</p>",
        "id": 453983890,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1721922520
    }
]