[
    {
        "content": "<p>I have been try the latest code in<code>dataverse-docker</code> and it failed to boot dataverse correctly. I find in the commit record that 6.2 has been revert, does that mean it is not ready yet</p>",
        "id": 457380541,
        "sender_full_name": "Henry Xu",
        "timestamp": 1723126516
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"598432\">@Slava Tykhonov</span> might be able to help you with dataverse-docker</p>",
        "id": 457388518,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1723128998
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"743173\">@link89</span> you can also try the upstream images. Please see <a href=\"https://guides.dataverse.org/en/6.3/container/running/demo.html\">https://guides.dataverse.org/en/6.3/container/running/demo.html</a></p>",
        "id": 457388609,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1723129030
    },
    {
        "content": "<p>I am thinking about a better way to implement docker deployment and here is some idea:</p>\n<p>instead of providing a full functional dataverse docker image, <br>\nmaybe it's better to provide a image with all artifact included, <br>\nand then the end user can just write a Dockerfile based on this image and use dvinstall script to config the service and run.</p>",
        "id": 459334574,
        "sender_full_name": "Henry Xu",
        "timestamp": 1723168545
    },
    {
        "content": "<p>You are of course free to do such a thing, no one will stop you.</p>\n<p>That said, for the past 5 years, I have been working on improving Dataverse to make it a near cloud native application. It's still a work in progress. </p>\n<p>What we have so far is documented in the guides Phil linked to. If you're interested in joining forces, feel free to join the Containerization Working Group. There's a channel at <a class=\"stream\" data-stream-id=\"375812\" href=\"/#narrow/stream/375812-containers\">#containers</a> where we discuss activities and the homepage at <a href=\"https://ct.gdcc.io\">https://ct.gdcc.io</a> has all our recordings and activities.</p>",
        "id": 459483637,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1723212547
    },
    {
        "content": "<p>I would like to after I success to run it. It looks like both 6.2 and 6.3 have unsolved bug, which version do you suggest to run in production?</p>",
        "id": 459495402,
        "sender_full_name": "Henry Xu",
        "timestamp": 1723215135
    },
    {
        "content": "<p>By the way, what's the main reason that make dockernize so hard to do?  I am keep blocking when running install.py in both docker and non-docker environment.</p>",
        "id": 459498147,
        "sender_full_name": "Henry Xu",
        "timestamp": 1723215655
    },
    {
        "content": "<p>Now I see what happens. It's proxy! <br>\nThe global proxy has been setup to install dependency and the <a href=\"http://setup-all.sh\">setup-all.sh</a> make use of curl to fire requests, which will respect the proxy setting.</p>",
        "id": 459510683,
        "sender_full_name": "Henry Xu",
        "timestamp": 1723218616
    },
    {
        "content": "<p>Like Oliver says, we'd be very happy to work with you!</p>",
        "id": 460097458,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1723474067
    }
]