[
    {
        "content": "<p>Hello Dataverse Community,</p>\n<p>According to the version 5.1x documentation, it is possible to delete a published Dataset.<br>\n<a href=\"https://guides.dataverse.org/en/5.10/api/native-api.html?highlight=destroy#id84\">https://guides.dataverse.org/en/5.10/api/native-api.html?highlight=destroy#id84</a></p>\n<p>In case of migration, it might be interesting to do it on the source server once the migration is successful on the target server.</p>\n<p>But here's my question: what is the status of the DOI of this dataset after using this \"destroy\" command?</p>\n<p>More specifically, does the Dataverse installation do anything with the DOI provider when doing this?</p>\n<p>For example, something like removing the uri for SEO or something else?</p>\n<p>I'm trying to find out if the supplier received an update or not when you call a \"destroy\"  command with API ?</p>\n<p>Thank you in advance for your answer,</p>\n<p>Regards</p>\n<p>EDITED:  after testing, is it possible to bypass the destruction of the DOI with this command?</p>",
        "id": 398831738,
        "sender_full_name": "Julien C",
        "timestamp": 1698388369
    },
    {
        "content": "<p>Hmm, no, I don't think so, but it's a good idea. Make sense that you'd want this. Please feel free to create an issue.</p>",
        "id": 398880371,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1698406423
    },
    {
        "content": "<p>Once a dataset is published, according to DataCite - if they are the DOI minter’s, that DOI must go to a landing page, why Deaccessioned datasets generate a tombstone page. Destroying a dataset in Dataverse repo, I assume does nothing on the DataCite-side because…</p>\n<p>You cannot delete a published DOI from DataCite, you can change the URL that the dataset resolves to, via DataCite API, and point it to another URL, but again, it cannot be deleted. The status can be updated from “findable” (indexed) to “registered”. See the link below</p>\n<p><a href=\"https://support.datacite.org/docs/can-i-delete-or-change-my-dois\">https://support.datacite.org/docs/can-i-delete-or-change-my-dois</a></p>",
        "id": 398896806,
        "sender_full_name": "Sherry Lake",
        "timestamp": 1698412525
    },
    {
        "content": "<p>Right. Yes. But when you're migrating a dataset to another Dataverse installation the idea is to update the DOI to point at the new installation, not delete the DOI.</p>",
        "id": 398903891,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1698415023
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"651537\">@Julien C</span> please remind me... you're keeping your old installation for some datasets? Or are you moving all of them to <span class=\"user-mention\" data-user-id=\"658065\">@Dimitri Szabo</span> 's installation?</p>",
        "id": 398903972,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1698415055
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"598112\">Philip Durbin</span> <a href=\"#narrow/stream/375707-community/topic/API.20-.20Delete.20Published.20Dataset/near/398903972\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"651537\">Julien C</span> please remind me... you're keeping your old installation for some datasets? Or are you moving all of them to <span class=\"user-mention silent\" data-user-id=\"658065\">Dimitri Szabo</span> 's installation?</p>\n</blockquote>\n<p>Moving all the datasets :)</p>",
        "id": 398908523,
        "sender_full_name": "Dimitri Szabo",
        "timestamp": 1698416528
    },
    {
        "content": "<p>Ok, so deleting (destroying) the old dataset is probably to help keep track of what has been moved already.</p>",
        "id": 398909301,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1698416803
    }
]