[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"601950\">@Thomas van Erven</span> received a response from AWS on the topic of whether the URI changes when files are transitioned to different storage classes in AWS S3 .. \"Transitioning objects using Amazon S3 Lifecycle won’t change the name/URI of the s3 object. It will only change the S3 storage class.\"</p>",
        "id": 390550264,
        "sender_full_name": "Deirdre Kirmis",
        "timestamp": 1694534253
    },
    {
        "content": "<p>And \"Secondly, transition action (when a specified date or time period in the object's lifetime is reached) for Nonversioned bucket or Versioning-enabled bucket, only transition the current version of the object to the specified storage class. Delete marker is not added for the transition or NoncurrentVersionTransition action.\"</p>",
        "id": 390550410,
        "sender_full_name": "Deirdre Kirmis",
        "timestamp": 1694534296
    },
    {
        "content": "<p>And for the second question \"do requests to an intelligently tiered file result in that file being re-assessed by tiering intelligence again?\" the answer is \"The Amazon S3 Intelligent-Tiering storage class automatically stores objects in three access tiers. One tier is optimized for frequent access, one lower-cost tier is optimized for infrequent access, and another very low-cost tier is optimized for rarely accessed data. For a low monthly object monitoring and automation charge, S3 Intelligent-Tiering monitors access patterns and automatically moves objects to the Infrequent Access tier when they haven't been accessed for 30 consecutive days. After 90 days of no access, the objects are moved to the Archive Instant Access tier without performance impact or operational overhead.\"</p>",
        "id": 390550491,
        "sender_full_name": "Deirdre Kirmis",
        "timestamp": 1694534327
    },
    {
        "content": "<p>\"If an object in the Infrequent Access tier or Archive Instant Access tier is accessed later, it is automatically moved back to the Frequent Access tier of the S3 Intelligent tiering. So, the object after the access doesn’t move back to S3 Standard storage.\"</p>",
        "id": 390550594,
        "sender_full_name": "Deirdre Kirmis",
        "timestamp": 1694534361
    }
]