[
    {
        "content": "<p>Hello, <br>\nI was wondering how often folks talk about Dataverse at the Code4Lib conference?  I found myself wondering if it could be an workshop at Code4Lib, to share about Dataverse and how it works?   Just a pondering though. </p>\n<p>Thoughts?<br>\nBethany</p>",
        "id": 554115701,
        "sender_full_name": "Bethany Seeger",
        "timestamp": 1762441790
    },
    {
        "content": "<p>Hmm, I know <span class=\"user-mention\" data-user-id=\"598733\">@Yamil Suarez</span> is involved with Code4Lib. He might have a sense.</p>\n<p><span class=\"user-mention\" data-user-id=\"737390\">@Bethany Seeger</span> have you been to their conferences before? You think a workshop on Dataverse might be a good fit?</p>",
        "id": 554140012,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1762447480
    },
    {
        "content": "<p>I've been before, though it has been a little while.  They do talk about digital repositories there and fedora, though maybe not in workshop format.   I'm sure data repositories would be of interest to some in that conference community, but since I haven't been in a while, I don't know how much interest there'd be.</p>\n<p>Given the change in regulations, people might be looking for new solutions, though.</p>",
        "id": 554140909,
        "sender_full_name": "Bethany Seeger",
        "timestamp": 1762447724
    },
    {
        "content": "<p>Actually, I have helped give workshops on Fedora there before... so I do think a presentation / workshop on Dataverse would fit in there.</p>",
        "id": 554141105,
        "sender_full_name": "Bethany Seeger",
        "timestamp": 1762447777
    },
    {
        "content": "<p>nice</p>",
        "id": 554149252,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1762449887
    },
    {
        "content": "<p>Sorry for my delay, and hello to Bethany hope you are well. It has been a while since we last spoke. Short answer, I don't know how often they talk about digital repositories at the Code4lib conference. </p>\n<p>Sadly, I have never been to a code4lib conference, my scheduling and travel budget have not aligned for me to attend. I have heard that over time there have been a few sessions here and there about the topic digital repositories. I think once in a while folks from the Islandora community have planned informal gatherings at the Code4lib conference to network with existing users or prospective users. I did a quick search on the Code4lib Slack workspace for \"dataverse\" and just noticed that a fellow Islandora committer, Seth Shaw at Arizona State University, says they run both Islandora and Dataverse at ASU. I can ask what he thinks, because I believe he attends the conference often. I wish I knew more, but with Code4lib I am mostly active in the Code4lib Slack channel dedicated to Python. As well as facilitating their related bi-monthly online meetings.</p>",
        "id": 554514370,
        "sender_full_name": "Yamil Suarez",
        "timestamp": 1762639855
    },
    {
        "content": "<p>Thanks, Yamil. Yes, from ASU we have <span class=\"user-mention\" data-user-id=\"598843\">@Deirdre Kirmis</span> and <span class=\"user-mention\" data-user-id=\"744896\">@Rachel Fernandez</span> and perhaps others. I got to catch up with them at <a class=\"stream-topic\" data-stream-id=\"375707\" href=\"/#narrow/channel/375707-community/topic/.23Dataverse2025/with/553441248\">#community &gt; #Dataverse2025</a>.</p>\n<p>FOSDEM encourages \"fringe events\" at their conference and we had one for <a href=\"http://www.arch.be/index.php?l=en&amp;m=news&amp;r=agenda&amp;e=fosdem-20-dataverse-fringe-meeting\">Dataverse</a> in <a href=\"https://archive.fosdem.org/2020/fringe/\">2020</a>. Maybe we could try this at a future Code4Lib conference.</p>",
        "id": 554571535,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1762702717
    },
    {
        "content": "<p>Thanks so much, <span class=\"user-mention\" data-user-id=\"598733\">@Yamil Suarez</span> - it has been a while. I hope you are well, too. </p>\n<p>Thanks for all the information.  </p>\n<p>We could do a birds of a feather event, during/after the conference if some of us are there.   That being said, I'm guessing it might be hard for me to be there this year.   Thanks for pondering this with me. :)</p>",
        "id": 554743872,
        "sender_full_name": "Bethany Seeger",
        "timestamp": 1762792406
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"621770\">@Julian Gautier</span> just invited code4lib folks to the next community meeting (thanks!): <a class=\"message-link\" href=\"/#narrow/channel/375707-community/topic/.23Dataverse2026/near/567976543\">#community &gt; #Dataverse2026 @ 💬</a></p>",
        "id": 567995394,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1768399886
    }
]