[
    {
        "content": "<p>UC Berkeley is setting up metadata harvesting between Dataverse and Alma. We have a crosswalk, but we'd like to compare it to another institution that has already done this. Anyone at an institution with Primo/Alma from Ex Libris who could help?</p>",
        "id": 521792740,
        "sender_full_name": "Anna Sackmann",
        "timestamp": 1748881893
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"709168\">@Anna Sackmann</span> hi! I just noticed that no one replied to this. <img alt=\":doh:\" class=\"emoji\" src=\"https://avatars.zulip.com/53090/emoji/images/343009b9.png\" title=\"doh\"> </p>\n<p>I see that <span class=\"user-mention\" data-user-id=\"598843\">@Deirdre Kirmis</span> is integrating Dataverse with Primo over at <a class=\"message-link\" href=\"/#narrow/channel/378866-troubleshooting/topic/Issue.20with.20OAI.20feed.20and.20changed.20field/near/509475709\">#troubleshooting &gt; Issue with OAI feed and changed field @ 💬</a> </p>\n<p>Also, you might want to email the google group, where you'll reach more people: <a href=\"https://groups.google.com/g/dataverse-community\">https://groups.google.com/g/dataverse-community</a></p>",
        "id": 526088650,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1751032332
    },
    {
        "content": "<p>Hi Anna! Following up on your email! I see that Jaime (or LSP dev) responded with some info on the Alma side .. was that helpful? </p>\n<p>Her response (if it helps anyone else): \"We have a very basic OAI DC discovery import profile set up in Alma. The dc:identifier is a DOI or handle so we use that for linking. We add the resource type and Open Access icons via normalization. We have been basing the OA icons on the value of dc:type, but that field is now hard-coded in the OAI feed so we need an alternative way to identify which datasets are open access via the OAI data. \" </p>\n<p>We aren't sure what the solution is yet for what we will use instead of dc:type but are looking at options like using Datacite or a different feed. Let us know how it is going with you! Also, if you have any other questions for Jaime.</p>",
        "id": 526097913,
        "sender_full_name": "Deirdre Kirmis",
        "timestamp": 1751034868
    }
]