[
    {
        "content": "<p>Hi, I met <span class=\"user-mention\" data-user-id=\"598183\">@Oliver Bertuch</span> at HMC Conference in Cologne, and he suggested I raise my issue here.</p>\n<p>I've noticed discrepancies between the DDI-Codebook metadata available via the web interface and through OAI-PMH. Specifically, the metadata accessed via OAI-PMH appears less rich.</p>\n<p>For example, using the web interface, I can download rich DDI-Codebook metadata for this dataset:<br>\n<a href=\"https://dataverse.harvard.edu/dataset.xhtml?persistentId=doi:10.7910/DVN/BT3LXD\">https://dataverse.harvard.edu/dataset.xhtml?persistentId=doi:10.7910/DVN/BT3LXD</a><br>\nDirect download link:<br>\n<a href=\"https://dataverse.harvard.edu/api/datasets/export?exporter=ddi&amp;persistentId=doi%3A10.7910/DVN/BT3LXD\">https://dataverse.harvard.edu/api/datasets/export?exporter=ddi&amp;persistentId=doi%3A10.7910/DVN/BT3LXD</a><br>\nThis version includes detailed elements such as <code>&lt;fileDscr&gt;</code> and <code>&lt;dataDscr&gt;</code>.</p>\n<p>However, when accessing the same dataset via OAI-PMH:<br>\n<a href=\"https://dataverse.harvard.edu/oai?verb=GetRecord&amp;identifier=doi:10.7910/DVN/BT3LXD&amp;metadataPrefix=oai_ddi\">https://dataverse.harvard.edu/oai?verb=GetRecord&amp;identifier=doi:10.7910/DVN/BT3LXD&amp;metadataPrefix=oai_ddi</a><br>\nthose elements are missing.</p>\n<p>While I can imagine there may be reasons for this difference, I encourage you to look into it and consider providing the richer DDI-Codebook metadata via OAI-PMH—especially since it’s already available through the web interface.</p>\n<p>Would it make sense to open a GitHub issue for this?</p>",
        "id": 518240516,
        "sender_full_name": "Knut Wenzig",
        "timestamp": 1747298376
    },
    {
        "content": "<p>Yes! Please do! <span class=\"user-mention\" data-user-id=\"598183\">@Oliver Bertuch</span> brought this up <a href=\"https://iqss.slack.com/archives/C010LA04BCG/p1747214532167669\">in Slack</a> yesterday (I know you can't see this) and linked to the <a href=\"https://hmc2025.welcome-manager.de/archiv/web/userfiles/hmc2025/Downloads1/35.pdf\">abstract</a> of your talk. <span class=\"user-mention\" data-user-id=\"637063\">@Leo Andreev</span> called it a solvable problem so please do open an issue!</p>",
        "id": 518268902,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1747306597
    },
    {
        "content": "<p>Done: <a href=\"https://github.com/IQSS/dataverse/issues/11493\">https://github.com/IQSS/dataverse/issues/11493</a></p>",
        "id": 518277089,
        "sender_full_name": "Knut Wenzig",
        "timestamp": 1747309082
    },
    {
        "content": "<p>There are probably more differences, do you have a list of all the DDI fields and their mappings? Looks like in the metadata doc the export API and OAI-PMH are grouped together, so we will have to look into the code and update this perhaps - <a href=\"https://docs.google.com/spreadsheets/d/1VAhZ83hKURX_4T-bOkn7XCb9h62Gr2gcJI1fWe4Rl4c/edit?gid=1901625433#gid=1901625433\">https://docs.google.com/spreadsheets/d/1VAhZ83hKURX_4T-bOkn7XCb9h62Gr2gcJI1fWe4Rl4c/edit?gid=1901625433#gid=1901625433</a></p>\n<p>It would be great to look into the DDI mappings across the Dataverse integrations for better alignment!! :) <span class=\"user-mention\" data-user-id=\"698148\">@Victoria Lubitch</span></p>",
        "id": 518307934,
        "sender_full_name": "Amber Leahey",
        "timestamp": 1747316639
    },
    {
        "content": "<p>Hi Knut,<br>\nThe decision to serve the \"skinny\" version of the DDI format (\"oai_ddi\") vs. the full DDI (\"ddi\") was made for purely practical reasons, based on the experience back when we used to serve the full version. <br>\nWith the \"&lt;dataDscr&gt;\" section included, the size of the resulting XML goes into tens of megabytes for a dataset with a large number of tabular datafiles. It was expensive to serve these records, and it was expensive for the harvesters to parse them (we learned in the process that most OAI harvester clients were NOT designed with the expectation of ever having to deal with large records). At the same time, most harvesters have zero need for the actual datavariable-level metadata from the \"&lt;dataDscr&gt;\" section - in most practical use cases, an instance harvesting from us just wants to gather the descriptive, dataset-level metadata so that they can index it in their search engines. So, the decision was made to support 2 flavors of the format, and have the short version served via the OAI. Under the assumption that anyone with a practical need for the variable-level metadata will obtain it via the metadata export API. <br>\n(So, for anyone else reading this - an important clarification is that access to the full version is not limited to the web interface; the metadata API will happily serve both oai_ddi and ddi). </p>\n<p>The above was just a long-ish explanation of the underlying history/legacy. If there is indeed a practical need for obtaining the full version of the format via OAI, the obvious solution is to just make both versions available and let harvesters decide which one they want (I would probably make it configurable on the individual Dataverse instance level, which formats they want to serve). There may already be a Dataverse fork out there where this has been done (Borealis, maybe?). Anyway, thank you for opening the issue, and yes, I do believe that this will be rather straightforward to implement. </p>\n<p>best,<br>\n-Leo</p>",
        "id": 518316319,
        "sender_full_name": "Leo Andreev",
        "timestamp": 1747318454
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"770128\">@Amber Leahey</span> I can confirm that the difference between the 2 formats is just as described in the opening comment: 1. oai_ddi does not include the \"&lt;dataDscr&gt;\" section. 2. In the oai_ddi, ALL the files in the dataset are listed as \"&lt;otherMat&gt;\" entries vs. in the full ddi ingested tabular datafiles are formatted under \"&lt;fileDscr&gt;\" sections that have some additional information, such as the numbers of variables and observations. <br>\nThe dataset-level, descriptive metadata sections are identical between the 2 flavors.</p>",
        "id": 518317901,
        "sender_full_name": "Leo Andreev",
        "timestamp": 1747318817
    },
    {
        "content": "<p>Thanks to all for the feedback and your time thinking about my issue.</p>\n<p>From our metadata I constructed a single &gt;500MB DDI-Codebook XML file (which corresponds to one DOI - <a href=\"https://www.doi.org/10.5684/soep.core.v39eu\">https://www.doi.org/10.5684/soep.core.v39eu</a>) and we had to learn that of the shelf OAI-PMH implementations did not expect this kind of XML files. So I am aware that fine-grained metadata will be more demanding. </p>\n<p><span class=\"user-mention silent\" data-user-id=\"637063\">Leo Andreev</span> <a href=\"#narrow/channel/375707-community/topic/DDI-Codebook.20via.20OAI-PMH.20less.20rich.20than.20via.20web.20interface/near/518316319\">said</a>:</p>\n<blockquote>\n<p>If there is indeed a practical need for obtaining the full version of the format via OAI, the obvious solution is to just make both versions available and let harvesters decide which one they want (I would probably make it configurable on the individual Dataverse instance level, which formats they want to serve).</p>\n</blockquote>\n<p>I would not underestimate what will be possible if this kind of rich metadata are in the world. In respect of discoverability fine-grained metadata will deliver better results than study-level metadata.  <span class=\"user-mention\" data-user-id=\"598432\">@Slava Tykhonov</span>  can do magic things with LLMs and Croissant. Even if there are no LLMs which understand DDI-Codebook, it is true that DDI-Codebook can be much richer than Croissant because the categories are not available in Croissant. And especially if one strips those metadata from Stata oder SPSS files (or similar) then they are the cheapest metadata in your system -  because no additional curation is needed.</p>\n<p>So I am watching the Github issue. And to be honest: I am already excited. :-)</p>",
        "id": 518325435,
        "sender_full_name": "Knut Wenzig",
        "timestamp": 1747320481
    },
    {
        "content": "<p>In <a href=\"https://docs.google.com/spreadsheets/d/1VAhZ83hKURX_4T-bOkn7XCb9h62Gr2gcJI1fWe4Rl4c/edit?gid=1901625433#gid=1901625433\">the crosswalk</a> that <span class=\"user-mention\" data-user-id=\"770128\">@Amber Leahey</span> mentioned, earlier in this thread I'll note somehow that variable-level metadata is missing from DDI-Codebook metadata when it's retrieved over OAI-PMH.</p>\n<p>A little tricky though since the crosswalk really only describes metadata at the dataset level, but I can at least leave a note</p>",
        "id": 519918566,
        "sender_full_name": "Julian Gautier",
        "timestamp": 1747946916
    }
]