[
    {
        "content": "<p>I just read through Deprecating metadata fields <a href=\"https://github.com/IQSS/dataverse/issues/10431\">#10431</a> by <span class=\"user-mention\" data-user-id=\"621770\">@Julian Gautier</span> </p>\n<p>Interesting issue.</p>\n<p><span class=\"user-mention\" data-user-id=\"599826\">@Sherry Lake</span> are you still customizing your citation metadata block? If memory serves you were removing some fields. This feels related to me, potentially.</p>",
        "id": 429732528,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1711484282
    },
    {
        "content": "<p>I'll look over the issue.<br>\nWe are not removing fields, but are \"hiding\" them during collection setup (since only Admins - me - can create collections).</p>",
        "id": 429863775,
        "sender_full_name": "Sherry Lake",
        "timestamp": 1711547493
    },
    {
        "content": "<p>Oh! I must be mis-remembering. I thought you had a custom citation.tsv with fewer fields.</p>",
        "id": 429864073,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1711547563
    },
    {
        "content": "<p>I have a custom citation.tsv - with display field name changes and watermark changes and one additional \"required\" field - Date of ?something? - production? creation?</p>",
        "id": 429864500,
        "sender_full_name": "Sherry Lake",
        "timestamp": 1711547677
    },
    {
        "content": "<p>I was thinking that <a href=\"https://github.com/IQSS/dataverse/issues/10431\">#10431</a> would be informed by whatever fields we end up removing during the redesign of the citation metadata block, if any.</p>\n<p>But learning from installations that have or are already dealing with this would be great too.</p>\n<p>We could look at other installations' metadata blocks to see which fields their managers have removed from the metadata blocks that ship with Dataverse, ask them if datasets using those fields had already been published in their repository before they removed those fields, and if that was the case, learn how they handled those changes.</p>",
        "id": 433609704,
        "sender_full_name": "Julian Gautier",
        "timestamp": 1713302685
    }
]