[
    {
        "content": "<div class=\"codehilite\"><pre><span></span><code>\n</code></pre></div>\n\n<p>Dear Colleagues,</p>\n<p>The EOSC Association [FAIR Metrics and Digital Objects Task Force] is reaching out to managers of research output repositories to assess the current practices, challenges, and opportunities surrounding supporting the sharing and reuse of research data, software, and publications.</p>\n<p>In particular, we wish to resolve how the repository management handles the following aspects:</p>\n<ul>\n<li>Schema interoperability, particularly for enabling data reuse and capturing their provenance, in federated environments;</li>\n<li>Policies, exploring if/how machine-actionable formats are applied;</li>\n<li>Gaps and metrics are used to assess where improvements are needed and how progress can be measured.</li>\n</ul>\n<p>Your input is crucial for shaping the future of the EOSC Federation. The insights we gather will inform the work of our Task Force, the efforts of the EOSC Opportunity Area Expert Groups, and other EOSC bodies working to build an interconnected and FAIR research ecosystem.</p>\n<p>To facilitate your participation, we will collect responses collaboratively during the focus group session. </p>\n<p>We intend to guide you through the questions together, provide clarification where needed, and support your completion of your responses by the end of the meeting. </p>\n<p>You are welcome to invite other colleagues (e.g., legal or technical experts, relevant decision-makers) to join as appropriate.<br>\nPlease find attached the PDF with the interview questions to help you prepare in advance.</p>\n<p>The data will be collected through a GDPR-compliant EU-based platform. Personal information will not be shared publicly, but the repository's name, organization, and country may be used to support aggregated analysis. The results will be made available to the community in an anonymised and analytical format.</p>\n<p>Focus Group Meeting</p>\n<p>Date: Monday, 22/09 at 15:00 CEST</p>\n<p>Please use the following <strong>link</strong> to complete your <strong>registration</strong> by <strong>September 20</strong> in order to secure your place: [https://eosc-eu.zoom.us/meeting/register/8QSsN-XuTAWGyPXS-o6Q1A]</p>\n<p>The meeting link will remain the same: [https://eosc-eu.zoom.us/meeting/register/8QSsN-XuTAWGyPXS-o6Q1A] </p>\n<p>Zoom will request that you re-enter your name to access the session.</p>\n<p>We truly appreciate your time and contribution to this activity and look forward to talking with you in a few weeks!</p>\n<p>We truly appreciate your time and contribution to this activity and look forward to talking with you in a few weeks!</p>\n<p>Best regards,</p>\n<p>Richard Dennis</p>\n<p>on behalf of</p>\n<p>Mark Wilkinson, UPM (chair)<br>\nElli Papadopoulou, ARC (co-chair)</p>",
        "id": 539736760,
        "sender_full_name": "Richard Dennis",
        "timestamp": 1758019715
    }
]