[
    {
        "content": "<p>Hi there,<br>\nI'm writing the issue for a feature but it has some items that should be discussed first, so feel free to react <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 432876247,
        "sender_full_name": "Dimitri Szabo",
        "timestamp": 1712918149
    },
    {
        "content": "<p>Here is the current description of the feature :</p>\n<h1>Overview of the Feature Request</h1>\n<p>As a repository administrator whose repository is harvested by Dataverse,<br>\nI can receive a notification when harvesting errors occur harvesting my repository.<br>\nIn order to identify the datasets that are not harvested and be able to improve the harvesting of my repository.</p>\n<h2>What kind of user is the feature intended for?</h2>\n<p>Harvested repository administrator (not necessarily a Dataverse user)</p>\n<h2>What inspired the request?</h2>\n<p>Use of Dataverse as a metadata catalog for Recherche Data Gouv.</p>\n<h1>Questions to be addressed about the feature</h1>\n<ol>\n<li>Should we rather consider sending notifications even if the harvesting is a success ?</li>\n<li>\n<p>Should this be an optional setting or is it sufficient that adding a contact email is optional ?<br>\n    * Should there be an option to set if the installation admin also receives such notifications ?</p>\n</li>\n<li>\n<p>Should we use Dataverse user accounts rather than emails  ? This would allow to be able to both<br>\n    * having the ability to send Dataverse notifications in addition/instead of an email<br>\n    * have the  being able to disable such notifications on an individual basis<br>\n    * and in the future maybe give harvested repositories admin access to a dedicated dashboard for their harvesting clients</p>\n</li>\n<li>\n<p>If yes (for 3.), would it be simpler to do it in two steps (emails and then maybe accounts) or directly with accounts ?</p>\n</li>\n<li>Could this feature or some of the prerequisite be associated with existing or future funding (e.g. NIH GREI) ?</li>\n</ol>\n<h1>Any brand new behavior do you want to add to Dataverse?</h1>\n<p>Two prerequisites are needed and could probably be done in parallel :</p>\n<h2>1. Being able to send a summary of Harvesting errors</h2>\n<p>As a Superuser,<br>\nWhen errors occur in Harvesting, I can receive an email notification providing the following information :</p>\n<ul>\n<li>Number and list of datasets that couldn't be Harvested</li>\n<li>\n<p>Report of the associated harvesting errors<br>\nIn order to be able to report and fix these errors<br>\nAssociated Issue :</p>\n<ul>\n<li>Send notifications for Harvesting errors listing the datasets that couldn't be harvested </li>\n<li>(Very likely, TBD) Improve the way Harvesting errors are described to make them more understandable</li>\n<li>Expand the Harvesting errors notification to include a report of the errors</li>\n</ul>\n<h2>2. Adding contact(s) email addresse(s) to Harvesting clients.</h2>\n</li>\n</ul>\n<p><strong>Needs clarification of question <em>3. Should we use Dataverse user accounts rather than emails  ?</em> before detailing either for emails only or Dataverse accounts.</strong></p>\n<p>As a Superuser,<br>\nI can add one or more email addresses to a harvesting client information<br>\nIn order to be able to contact the harvested repository administrator<br>\nAssociated Issue :</p>\n<p>- Expand API creation of Harvesting Clients to add contact(s)<br>\n  - (Directly in the SPA) Add contact(s) in the Harvesting Clients creation form</p>",
        "id": 432876337,
        "sender_full_name": "Dimitri Szabo",
        "timestamp": 1712918179
    },
    {
        "content": "<p>Interesting. At a high level, sure, I can see how this could be useful. For a client we show if harvesting failed or not but we don't show if the server-side failed (neither set nor entire collection). <span class=\"user-mention\" data-user-id=\"637063\">@Leo Andreev</span> would probably be able to guess how much effort it would be. And <span class=\"user-mention\" data-user-id=\"621770\">@Julian Gautier</span> handles harvesting for Harvard Dataverse (client-side, at least). He might be interested in this feature.</p>\n<p><span class=\"user-mention\" data-user-id=\"658065\">@Dimitri Szabo</span> if we forget about errors for a moment, do you already have an idea of how many of your datasets are harvested and from where? How would you know? Logs?</p>",
        "id": 432885557,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1712922013
    },
    {
        "content": "<p>Yes the benefits of this proposal would be great!</p>\n<p>The GitHub issue at <a href=\"https://github.com/IQSS/dataverse/issues/9294\">https://github.com/IQSS/dataverse/issues/9294</a> feels related to me.</p>\n<p>And last week I think I saw another GitHub issue that might be helpful to be aware of. It was also about giving installation admins more information about the status of harvesting clients and attempts. I can't seem to find that GitHub issue. <span class=\"user-mention\" data-user-id=\"600327\">@Ceilyn Boyd</span> is this a GitHub issue you might have opened?</p>",
        "id": 433313938,
        "sender_full_name": "Julian Gautier",
        "timestamp": 1713193121
    },
    {
        "content": "<p>I was thinking about this, could there be cases where the failure happens on the client's side while trying to harvest from an installation? for example network failures and do administrators want to be notified when someone tries to harvest from them and it fails if they can't do anything? What would be the criteria to determine if a failure should be notified or not? Also If I have a Harvesting Server that is harvested by 20 installations probably I wouldn't like to receive 20 emails <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 433383588,
        "sender_full_name": "Juan Pablo Tosca Villanueva",
        "timestamp": 1713214002
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"598112\">Philip Durbin</span> <a href=\"#narrow/stream/375707-community/topic/Feature.20.3A.20Notify.20harvested.20repo.20admins.20of.20harvesting.20errors/near/432885557\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"658065\">Dimitri Szabo</span> if we forget about errors for a moment, do you already have an idea of how many of your datasets are harvested and from where? How would you know? Logs?</p>\n</blockquote>\n<p>We currently have no view on how many datasets are harvested, we usually only check the platforms where we want to be harvested. I don't know if you could check that globally via the logs it'd be very interesting to know.</p>",
        "id": 433459553,
        "sender_full_name": "Dimitri Szabo",
        "timestamp": 1713252672
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"648750\">Juan Pablo Tosca Villanueva</span> <a href=\"#narrow/stream/375707-community/topic/Feature.20.3A.20Notify.20harvested.20repo.20admins.20of.20harvesting.20errors/near/433383588\">said</a>:</p>\n<blockquote>\n<p>I was thinking about this, could there be cases where the failure happens on the client's side while trying to harvest from an installation? for example network failures and do administrators want to be notified when someone tries to harvest from them and it fails if they can't do anything? What would be the criteria to determine if a failure should be notified or not?</p>\n</blockquote>\n<p>That's a great point, I think it could still be helpful to have this information even if there is not always a solution on the \"harvested side\", but as you pointed out maybe not in every case and with the ability to disable notifications from an installation that could always fail.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"648750\">Juan Pablo Tosca Villanueva</span> <a href=\"#narrow/stream/375707-community/topic/Feature.20.3A.20Notify.20harvested.20repo.20admins.20of.20harvesting.20errors/near/433383588\">said</a>:</p>\n<blockquote>\n<p>Also If I have a Harvesting Server that is harvested by 20 installations probably I wouldn't like to receive 20 emails <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>\n</blockquote>\n<p>Yes, that's where using user accounts or other mechanism allowing to disable notification at the user level would be helpful.</p>",
        "id": 433460967,
        "sender_full_name": "Dimitri Szabo",
        "timestamp": 1713253233
    },
    {
        "content": "<p>For helping troubleshoot issues with the harvesting that Harvard Dataverse is doing, I've been using the Dataverse API and scraping repositories' OAI-PMH feeds to create this spreadsheet: <a href=\"https://docs.google.com/spreadsheets/d/1ek3AMYDWBo3ck6D18Q47FL1lTDbkLbf7tWhHliVtjbQ\">https://docs.google.com/spreadsheets/d/1ek3AMYDWBo3ck6D18Q47FL1lTDbkLbf7tWhHliVtjbQ</a>. Let me know if you'd like to talk more about this.</p>\n<p>The GitHub issue at <a href=\"https://github.com/IQSS/dataverse-pm/issues/171\">https://github.com/IQSS/dataverse-pm/issues/171</a> lists most if not all of the issues we've been working on, too.</p>",
        "id": 433524858,
        "sender_full_name": "Julian Gautier",
        "timestamp": 1713274731
    }
]