[
    {
        "content": "<p>Hi everyone,</p>\n<p>I'm Charity Everett, and I'm excited to be part of this community! I'm currently working on a <strong>WebXR data visualization demo</strong> for a subsection of the Dataverse and I'm curious about:</p>\n<ol>\n<li>\n<p>Has anyone in the community worked on WebXR visualizations for any parts of the Dataverse? If so, what challenges or successes have you encountered?</p>\n</li>\n<li>\n<p>Are there any best practices or existing tools within the Dataverse ecosystem that could be particularly useful for visualizing large-scale data?</p>\n</li>\n<li>\n<p>What opportunities do you see for using immersive technologies to enhance the exploration and analysis of datasets?</p>\n</li>\n</ol>\n<p>I appreciate any insights or resources you can share. Looking forward to collaborating with you all!</p>\n<p>Best,<br>\nCharity Everett</p>",
        "id": 489014341,
        "sender_full_name": "Charity Everett",
        "timestamp": 1734199421
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"812768\">@Charity Everett</span> welcome! I don't think I have any particular insight to share for your three points but I'm curious... what subsection of datasets are you interested in? Maybe by looking at a few of these datasets we'll get some ideas of how we might visualize them.</p>",
        "id": 489253858,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1734359996
    },
    {
        "content": "<p>Thank you for the warm welcome, Philip! I appreciate your interest in my project. I'm particularly interested in legal datasets, especially those related to the Caselaw Access Project. However, I'm open to exploring other datasets that might benefit from WebXR visualization.</p>\n<p>I'd love to discuss this further and perhaps look at some specific datasets together. Would you be available for a brief e-meeting before the Thursday morning working group session? I'm planning to attend that as well, but a one-on-one conversation could be really helpful in shaping my approach.</p>\n<p>If you're open to it, I could share my screen and show you some of my initial ideas for WebXR visualization. Your insights would be invaluable in refining my concept and understanding how it might best serve the Dataverse community. Let me know if you have any availability, and I'll be happy to work around your schedule.</p>",
        "id": 489329437,
        "sender_full_name": "Charity Everett",
        "timestamp": 1734379007
    },
    {
        "content": "<p>Hmmm... maybe! I'll send you a DM to see if our schedules line up.</p>",
        "id": 489329706,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1734379082
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"812768\">@Charity Everett</span> great talking to you! I meant to say it was very kind of you to say you'd help out with our upcoming community meeting. And, yes, you did mention your WebXR interests in that post: <a href=\"https://groups.google.com/g/dataverse-community/c/2cHokNpvSX8/m/CFx0YOzBAAAJ\">https://groups.google.com/g/dataverse-community/c/2cHokNpvSX8/m/CFx0YOzBAAAJ</a> . I hope people noticed! It sounds great!</p>",
        "id": 489777811,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1734534479
    },
    {
        "content": "<p>After we hung up I was thinking... can you show us a \"hello world\" for WebXR? Or maybe one that you've built?</p>",
        "id": 489778116,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1734534548
    },
    {
        "content": "<p>This feels related at least... ways to visualize 3D data:</p>\n<p>Feature Request: Add to the metadata blocks that ship with Dataverse a metadata block for describing 3D data <a href=\"https://github.com/IQSS/dataverse/issues/11120\">#11120</a></p>",
        "id": 490184692,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1734709023
    }
]