[
    {
        "content": "<p>I just noticed this: <a href=\"https://ask.cyberinfrastructure.org/t/remote-position-at-tufts-research-data-management-specialist/4188\">https://ask.cyberinfrastructure.org/t/remote-position-at-tufts-research-data-management-specialist/4188</a></p>",
        "id": 503309181,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1741105199
    },
    {
        "content": "<p>(cross posting from <a href=\"https://groups.google.com/g/dataverse-community/c/6MTGqIfW8NM?pli=1\">https://groups.google.com/g/dataverse-community/c/6MTGqIfW8NM?pli=1</a>)</p>\n<p>Dear Dataverse Community!</p>\n<p>We are looking for a community manager to build and run \"JuRDM\", the Jülich Research Data Management Community.</p>\n<p>Have you worked as a community manager before? Do you enjoy connecting people? Is research data management what makes you sit on edge?</p>\n<p>If you would like to work for the second largest German research institute (~7500 employees) and bring together all those building excellent solutions for research data management for the FZJ, Helmholtz and beyond, lets talk!</p>\n<p>JuRDM will happen in close coordination with the <a href=\"https://www.fz-juelich.de/en/rse\">JuRSE community</a> and especially with our JuRSE community manager <a href=\"https://www.fz-juelich.de/profile/wyatt_cl\">Claire Wyatt</a>. My colleagues from the Central Library's Campus RDM team and me will also be folks you work with closely.</p>\n<p>We are looking forward to hear from folks from all over the world. It's not important that you don't speak German, fluent English is sufficient to work at Jülich Research Centre. Being able to connect to people in<br>\nperson <a href=\"https://www.openstreetmap.org/relation/18253276#map=16/50.90525/6.41156\">on campus</a> combined with remote work options is a must. We offer a fulltime or near fulltime position. Your salary depends on experience and qualification, aiming for TVöD E13 here. [1]</p>\n<p>If you are interested, please reach out to me by mail or DM to exchange further details.</p>\n<p>[1]: A detailed list of the approximate monthly salaries to be expected within the TVöD framework can be found at <a href=\"https://oeffentlicher-dienst.info/c/t/rechner/tvoed/bund?id=tvoed-bund-2024&amp;matrix=1\">https://oeffentlicher-dienst.info/c/t/rechner/tvoed/bund?id=tvoed-bund-2024&amp;matrix=1</a></p>",
        "id": 507740943,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1742818264
    }
]