[
    {
        "content": "<p>Dear all,</p>\n<p>I hope you had a great start to the new year!</p>\n<p>We invite you to the first meeting of the PyDataverse working group, where we'll present and discuss our proposal for PyDataverse's future development. We are committed to improving PyDataverse and have identified the following milestones:</p>\n<ul>\n<li>Re-establishment and extension of the testing framework for future contributions.</li>\n<li>Fix open issues and review open contributions.</li>\n<li>Extend PyDataverse's functionality to interface with Dataverse (CLI and high-level features).</li>\n<li>OpenAPI-based code generation to integrate upstream changes automatically.</li>\n</ul>\n<p>We understand your input is essential and would very much appreciate your participation. The meeting series will begin next week and occur every two weeks. Please find the date and location of the upcoming meeting below:</p>\n<p>Wednesday, January 17th, 3 PM UTC (10 AM ET / 4 PM CET)<br>\n<a href=\"https://unistuttgart.webex.com/unistuttgart/j.php?MTID=m322473ae7c744792437ce854422e52a3\">https://unistuttgart.webex.com/unistuttgart/j.php?MTID=m322473ae7c744792437ce854422e52a3</a></p>\n<p>You can also find all meeting dates and locations in the Dataverse Community Call Calendar. If you have any further questions or contributions, please do not hesitate to contact me.</p>\n<p>We hope you can join us, and we are excited to make progress together! </p>\n<p>Take care, and have a wonderful week.</p>\n<p>Best regards,<br>\nJan</p>",
        "id": 412145181,
        "sender_full_name": "Jan Range",
        "timestamp": 1704895324
    },
    {
        "content": "<p>Unfortunately, I won't be able to make it to any of those - kids duty. Have fun y'all!</p>",
        "id": 412305321,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1704966854
    },
    {
        "content": "<p>Dear all,</p>\n<p>The initial pyDataverse Working Group kickoff meeting is happening today. We're excited to chat about the future development of pyDataverse and would love to have you join us! </p>\n<p>I've included the time and location for today's meeting below.</p>\n<p>Wednesday, January 17th, 3 PM UTC (10 AM ET / 4 PM CET)<br>\n<a href=\"https://unistuttgart.webex.com/unistuttgart/j.php?MTID=m322473ae7c744792437ce854422e52a3\">https://unistuttgart.webex.com/unistuttgart/j.php?MTID=m322473ae7c744792437ce854422e52a3</a></p>\n<p>We are also happy to share that we've created a website exclusively for our working group. This website contains an overview of our goals, upcoming meetings, and notes/recordings from past meetings. You can access the website using the following address:</p>\n<p><a href=\"https://py.gdcc.io\">https://py.gdcc.io</a> </p>\n<p>If you have any questions or need any assistance, please don't hesitate to let us know. </p>\n<p>We are looking forward to seeing you there!</p>",
        "id": 415978832,
        "sender_full_name": "Jan Range",
        "timestamp": 1705481563
    },
    {
        "content": "<p>Dear all,</p>\n<p>I hope you're doing well. I wanted to let you know that unfortunately, we've had to cancel the upcoming PyDataverse Working Group Meeting on Wednesday due to conflicting schedules.</p>\n<p>However, we'll be back on the 24th of April at 2:00 PM UTC for our next meeting. If you're interested, you can check out notes and recordings of previous meetings and all upcoming ones on our website at <a href=\"https://py.gdcc.io/\">py.gdcc.io</a>.</p>\n<p>All the best,<br>\nJan</p>",
        "id": 432166710,
        "sender_full_name": "Jan Range",
        "timestamp": 1712651573
    }
]