[
    {
        "content": "<p>Hello, <br>\nI'm trying to understand how Dataverse manages metadata. I understand at a high and maybe medium level about metadata blocks and how to add custom ones.  </p>\n<p>I'm trying to figure out how the system thinks about metadata it distributes when exporting via the UI or harvesting.  For example, when you export metadata, say in DDI format, will I only get the fields that are part of DDI across all metadata blocks?   Or in DC, will I only get the field if it has a DC termURL in the tsv file?   Basically I'm trying to figure out how the system picks which fields to export, per export format. </p>\n<p>We've enabled a OAI-PMH harvesting client and are using it to harvest oai_ddi format.  What I understand from that is that we'd get DDI fields.  What I don't understand about that is what fields exactly do we get from from the server we are harvesting from?  </p>\n<p>Sorry if this is a basic question.  I'm new to DDI - so I may have some basic misunderstandings there.   Thanks, in advance, for any help.</p>",
        "id": 471323047,
        "sender_full_name": "Bethany Seeger",
        "timestamp": 1726684265
    },
    {
        "content": "<p>As you've noticed, you have a variety of formats to choose from when setting up a harvesting client.</p>",
        "id": 471324971,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1726684976
    },
    {
        "content": "<p>DDI is a fine choice, much richer than DC.</p>",
        "id": 471325002,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1726684991
    },
    {
        "content": "<p>You can pick Dataverse's native JSON format if you happen to be harvesting from another installation of Dataverse. It's the most complete harvesting format, and will include custom metadata blocks, but you have to have Dataverse on each side.</p>",
        "id": 471325104,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1726685034
    },
    {
        "content": "<p>To get a sense of which DDI fields will be imported and where, I'd suggest looking at the <a href=\"https://docs.google.com/spreadsheets/d/10Luzti7svVTVKTA-px27oq3RxCUM-QbiTkm8iMd5C54/edit?usp=sharing\">crosswalk</a> linked from <a href=\"https://guides.dataverse.org/en/6.3/user/appendix.html\">https://guides.dataverse.org/en/6.3/user/appendix.html</a></p>",
        "id": 471325430,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1726685144
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"621770\">@Julian Gautier</span> maintains that crosswalk.</p>",
        "id": 471325536,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1726685165
    },
    {
        "content": "<p>Thanks, Phil.  So if we used, just for sake of example, DC, then the system would use this crosswalk to put together the record it would export?   </p>\n<p>Does this mean that if you create a custom metadata block and introduced new DC fields to the system, that the only export these fields would show up in is the JSON one?</p>",
        "id": 471326893,
        "sender_full_name": "Bethany Seeger",
        "timestamp": 1726685682
    },
    {
        "content": "<p>Well, when you harvest, you only get what we call a \"search card\" in your system. I don't think you can export it.</p>",
        "id": 471327675,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1726685960
    },
    {
        "content": "<p>The idea is that the dataset is discoverable in your system but when someone clicks, they are sent to the original source.</p>",
        "id": 471327742,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1726685988
    },
    {
        "content": "<p>That makes sense. We were just curious about which fields were harvested.  All the DDI fields, or a subset?</p>",
        "id": 471327879,
        "sender_full_name": "Bethany Seeger",
        "timestamp": 1726686015
    },
    {
        "content": "<p>Well, the DDI fields have to be filled in, but, yes, all of them. <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 471328160,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1726686106
    },
    {
        "content": "<p>I think! Again, I guess I'd refer you to that crosswalk doc.</p>",
        "id": 471328268,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1726686127
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"737390\">Bethany Seeger</span> <a href=\"#narrow/stream/375707-community/topic/Metadata.20Export.20and.20OAI.20PMH/near/471326893\">said</a>:</p>\n<blockquote>\n<p>Does this mean that if you create a custom metadata block and introduced new DC fields to the system</p>\n</blockquote>\n<p>I'm a little confused by this. Are we missing some DC fields? I think there are only 15. I thought we had them all already.</p>",
        "id": 471328555,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1726686229
    },
    {
        "content": "<p>No I'm sure I just picked a bad example. :)</p>",
        "id": 471328668,
        "sender_full_name": "Bethany Seeger",
        "timestamp": 1726686258
    },
    {
        "content": "<p>But yes, from a harvesting perspective only Dataverse's native JSON contains custom metadata blocks.</p>\n<p>I believe OAI_ORE is also complete in this sense but last I checked it can't be used for harvesting.</p>",
        "id": 471328916,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1726686359
    },
    {
        "content": "<p>Thanks, Phil.  I appreciate your help.</p>",
        "id": 471337610,
        "sender_full_name": "Bethany Seeger",
        "timestamp": 1726689337
    },
    {
        "content": "<p>Sure. Good luck!</p>",
        "id": 471339798,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1726690151
    }
]