[
    {
        "content": "<p>Hello, </p>\n<p>We have a few collections we'd like to migrate into Dataverse where the files are already in an S3 bucket and curated by another application.  Ideally we wouldn't have to move the files, as they could be, in theory, accessed from where they already are, plus they already have handles pointing to them there (not that we couldn't change this pointer, I think).   We'd like to just give Dataverse access to this other bucket, in addition to it's other datastores. </p>\n<p>I know it'd be straightforward, via the native API, to move the <em>metadata</em> into Dataverse.  For the files, if we didn't want to migrate them, would we essentially be following the process for moving a large data set?  <br>\n0) ensure that the second S3 bucket is configured to be access by Dataverse </p>\n<p>1) have the metadata migration create place holder files for the datasets</p>\n<p>2) have a script that manipulates the Dataverse database to point to the right S3 bucket and location w/i it.  (This would be more than just replacing a placeholder, as the files wouldn't be where the place holder was set)</p>\n<p>Would this work? </p>\n<p>There are a few unknowns for us -- </p>\n<ol>\n<li>Can dataverse link to mulitple S3 buckets?  </li>\n<li>Is the only way to make the connection from the datasets to the file in S3 be by manipulating the database?</li>\n</ol>\n<p>Note: As mentioned, we do have Handles on the files that point directly to the files in the buckets, and one thought we've had is to just use those as links to the data in the Dataverse record. </p>\n<p>(I don't think OAI-PMH harvesting would be enough for this collection because the Datasets wouldn't technically be hosted elsewhere to point to.  The goal here is to have the dataset in one place and the curation tool and the public access website (Dataverse) access it from there)</p>\n<p>I'm still very new to Dataverse, so there might be other options I missing.  Would love to hear some perspectives on this.</p>",
        "id": 465841755,
        "sender_full_name": "Bethany Seeger",
        "timestamp": 1724875647
    },
    {
        "content": "<p>My first thought is that Jim Myers knows the most about this so you might want to cross post to <a href=\"https://groups.google.com/g/dataverse-community\">https://groups.google.com/g/dataverse-community</a> to get his attention. <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 465844763,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1724876976
    },
    {
        "content": "<p>Yes, Dataverse can link to multiple S3 buckets. Each \"store\" can be configured separately, to use the same bucket, to use different buckets; it's up to you.</p>",
        "id": 465844958,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1724877045
    },
    {
        "content": "<p>You might want to look into Trusted Remote Storage: <a href=\"https://guides.dataverse.org/en/6.3/installation/config.html#trusted-remote-storage\">https://guides.dataverse.org/en/6.3/installation/config.html#trusted-remote-storage</a></p>",
        "id": 465845039,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1724877088
    },
    {
        "content": "<p>Do you want Dataverse to take over management of the files? Or do you want to manage them in S3 separately and simply let Dataverse know where the files live?</p>",
        "id": 465845190,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1724877149
    },
    {
        "content": "<p>Thanks, Phil.  I'll cross post there. <br>\nGood question about file management. For this collection of data, I think it might be the later option, but I'll have to ask the collection manager.   What does it mean to have Dataverse take over management of the files?</p>",
        "id": 465845843,
        "sender_full_name": "Bethany Seeger",
        "timestamp": 1724877441
    },
    {
        "content": "<p>Here's the <a href=\"https://groups.google.com/g/dataverse-community/c/133bNBCtXYc/m/NYV77HAXCgAJ\">cross post</a>. Thanks again.</p>",
        "id": 465848678,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1724878662
    },
    {
        "content": "<p>Well, do you want Dataverse to be able to delete files?</p>",
        "id": 465848702,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1724878676
    },
    {
        "content": "<p>When a dataset is in draft and files are deleted, they are removed from the S3 bucket. Poof.</p>",
        "id": 465848773,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1724878695
    },
    {
        "content": "<p>A new reply from Jim: <a href=\"https://groups.google.com/g/dataverse-community/c/133bNBCtXYc/m/mZkJ-3W_AAAJ\">https://groups.google.com/g/dataverse-community/c/133bNBCtXYc/m/mZkJ-3W_AAAJ</a></p>",
        "id": 468873748,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1725904273
    }
]