[
    {
        "content": "<p>I'm not sure where this question would go.  The system admin helping me with up grades asked this.</p>\n<p>About system architecture:</p>\n<ul>\n<li>\n<p>what is the preferred and/or optimal architecture for supporting the Dataverse application? <br>\n     - All-in-one (where dataverse, solr, postgres reside on a single host)<br>\n-or  distributed (where dataverse, solr, postgres reside on their own separate dedicated hosts)</p>\n</li>\n<li>\n<p>what are the metrics (e.g. system resource utilization, number of users, etc.) that indicate moving from an all-in-one to distributed architecture is recommended?</p>\n</li>\n<li>at what point does the community recommend an all-in-one architecture be adjusted to use a distributed architecture?</li>\n<li>If we moved our architecture to a distributed model that includes a single dataverse node, a single solr node, and a single postgres node - does the community see any reason why this could be problematic from a configuration, complexity, or supportability standpoint?</li>\n</ul>",
        "id": 426443759,
        "sender_full_name": "jamie jamison",
        "timestamp": 1710372839
    },
    {
        "content": "<p>I'm not completely sure where this question should go. Its from the system admin who helps with our upgrades.   The tipping point between on machine for everything and splitting into dedicated hosts doesn't seem to be covered in the documentation so I couldn't come close to answering his question.</p>\n<p>About the system architecture:<br>\nwhat is the preferred and/or optimal architecture for supporting the Dataverse application?</p>\n<p>all-in-one (where dataverse, solr, postgres reside on a single host)<br>\nor distributed (where dataverse, solr, postgres reside on their own separate dedicated hosts)</p>\n<p>what are the metrics (e.g. system resource utilization, number of users, etc.) that indicate moving from an all-in-one to distributed architecture is recommended?<br>\nat what point does the community recommend an all-in-one architecture be adjusted to use a distributed architecture?</p>\n<p>If we moved our architecture to a distributed model that includes a single dataverse node, a single solr node, and a single postgres node - does the community see any reason why this could be problematic from a configuration, complexity, or supportability standpoint?</p>\n<p>Thank you,</p>\n<p>Jamie Jamison / UCLA Dataverse</p>",
        "id": 426444042,
        "sender_full_name": "jamie jamison",
        "timestamp": 1710373045
    },
    {
        "content": "<p>If it helps, here's the write up of  the architecture for Harvard Dataverse (not all-in-one): <a href=\"https://guides.dataverse.org/en/6.1/installation/prep.html#hardware-requirements\">https://guides.dataverse.org/en/6.1/installation/prep.html#hardware-requirements</a></p>",
        "id": 426446730,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1710375107
    },
    {
        "content": "<p>I'm not an expert for classic installations. That said: these questions really are one of the reasons why containers are so strong. The different components of Dataverse are singled out to single containers, easy to move around etc. Single VM per function is a healthy pattern, but creates a lot of overhead for OS maintenance.</p>",
        "id": 426485036,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1710402239
    },
    {
        "content": "<p>If you go for some tooling to deal with that (e.g. Terraform), it is getting cheaper to setup these things. But it will require learning new tools.</p>",
        "id": 426485161,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1710402290
    },
    {
        "content": "<p>I suggest going for an AIO first and setting up proper monitoring to gather these metrics</p>",
        "id": 426485204,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1710402312
    },
    {
        "content": "<p>RAM is probably the most pressing issue, depending on your workload.</p>",
        "id": 426485261,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1710402348
    },
    {
        "content": "<p>I dunno about your environment, but maybe the already have a system like Prometheus / InfluxDB / ... in place where you could gather information and see if you're running short on resources.</p>",
        "id": 426485410,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1710402419
    },
    {
        "content": "<p>The <code>/metrics</code> endpoint is already exposing a lot of details about resources Payara uses. Combining with metrics from the reverse proxy about the numbers of requests etc this might give you some real insight into how your folks use your instance and where bottlenecks are.</p>",
        "id": 426485660,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1710402540
    },
    {
        "content": "<p>These are the sorts of things I worry about with regard to the deployed architecture being distributed or centralized:</p>\n<ul>\n<li>system stability: can my system handle the load and do I have a plan for scaling horizontally or vertically?</li>\n<li>complexity: is it relatively straightforward to manage the system?</li>\n<li>single points of failure: if part of the system goes down, is the whole system down?</li>\n<li>disaster recovery: if the whole system is destroyed, how can I get it back up?</li>\n</ul>",
        "id": 426522617,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1710416341
    },
    {
        "content": "<p>Thank you both for the input.  The question was really from the systems person who helps me with the updates and maintenance.   I'll  go over the guide and try to get back to him with an answer.<br>\nUCLA Dataverse started with a smaller system.  AWS, on EC2 instance and s3 buckets for data.  Depositing is limited to the UCLA community though others can download via federated login.  At some point in the future it will have to be broken up but that is beyond my experience.</p>",
        "id": 427779594,
        "sender_full_name": "jamie jamison",
        "timestamp": 1710870188
    },
    {
        "content": "<p>Ok, please keep us posted and let us know if we can answer any questions!</p>",
        "id": 427836946,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1710897603
    }
]