[
    {
        "content": "<p>Happy New Year! At Johns Hopkins University, the data curators have always mediated the entire metadata and payload deposit process for our researchers. In other words, only admins of our Dataverse instance have accounts, and we obtain the dataset metadata and files using a method outside of the Dataverse Project software. However, we are going to be transitioning to the more typical repository workflow where we permit our researchers to create draft datasets and these get submitted to curators for review prior to publication.</p>\n<p>Ideally, we would prefer a workflow where the researchers are only allowed to enter metadata, but not upload the actual data files. Once we receive a notification that a draft dataset has been created, we would then reach out to the researcher to discuss file transfer methods. Perhaps I am mistaken, but after reviewing the documentation, it doesn’t appear that any of the existing roles decouple the act of entering metadata for a draft dataset and the ability to upload files. Please let me know if I am wrong and I can share how to accomplish this with my systems administrator. We plan to also modify the language in the UI requesting that researchers do not upload their files to their draft dataset.  </p>\n<p>If there isn't an existing method for permitting only curators to upload files, would there be any value to others in the Dataverse Project community to have this functionality? Happy to explain our rationale if that is helpful to understanding why we’d prefer this workflow.</p>",
        "id": 566378354,
        "sender_full_name": "Betsy Gunia",
        "timestamp": 1767626513
    },
    {
        "content": "<p>Happy New Year! Yes, you're right. If you can edit a dataset, you can upload files.</p>",
        "id": 566393342,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1767630397
    },
    {
        "content": "<p>To change this, we'd need to split off the \"upload files\" permission from the \"edit dataset\" permission. The most recent time we split off a permission was here, I think: <a href=\"https://github.com/IQSS/dataverse/issues/11691\">#11691</a> (linking became a different permission, split of from publishing).</p>",
        "id": 566393743,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1767630502
    },
    {
        "content": "<p>Thank you for confirming it is not currently possible. I am not a developer, so I have no sense of how much pain such a feature request would be. I imagine there would need to be changes to the UI as well perhaps, in addition to a new permission.</p>",
        "id": 566408770,
        "sender_full_name": "Betsy Gunia",
        "timestamp": 1767635180
    },
    {
        "content": "<p>Would you recommend that I ask via the Google Group as well? I am curious if others would find value in this or are we odd ducks for requesting something like this.</p>",
        "id": 566408990,
        "sender_full_name": "Betsy Gunia",
        "timestamp": 1767635259
    },
    {
        "content": "<p>Sure, asking in the Google Group as well sounds good.</p>",
        "id": 566413976,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1767637072
    },
    {
        "content": "<p>I doubt you're odd ducks <span aria-label=\"smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"smile\">:smile:</span> <span aria-label=\"duck\" class=\"emoji emoji-1f986\" role=\"img\" title=\"duck\">:duck:</span></p>",
        "id": 566414074,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1767637115
    },
    {
        "content": "<p>Your post looks great: <a href=\"https://groups.google.com/g/dataverse-community/c/jcztfZ4Vq1Y/m/MoCBI0zjBQAJ\">https://groups.google.com/g/dataverse-community/c/jcztfZ4Vq1Y/m/MoCBI0zjBQAJ</a></p>\n<p>I saw the reply but it seems like you're already well aware of the \"submit for review/return to author\" workflow.</p>",
        "id": 566604760,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1767726262
    },
    {
        "content": "<p>Oh! <span class=\"user-mention\" data-user-id=\"885545\">@Mansoor Koormath</span> is here in Zulip too. Thanks for replying on the Google Group.</p>",
        "id": 566604861,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1767726304
    },
    {
        "content": "<p>Yes, we definitely plan to use the \"submit for review\" functionality :-) <br>\nI appreciate your comment <span class=\"user-mention\" data-user-id=\"885545\">@Mansoor Koormath</span> though!</p>",
        "id": 566617671,
        "sender_full_name": "Betsy Gunia",
        "timestamp": 1767731596
    },
    {
        "content": "<p>Dear Zulip,</p>\n<div class=\"codehilite\"><pre><span></span><code> Thank you for your response. 🙂\n</code></pre></div>\n\n<p>Regards</p>\n<p>Mansoor Koormath</p>",
        "id": 566648173,
        "sender_full_name": "Mansoor Koormath",
        "timestamp": 1767750663
    }
]