[
    {
        "content": "<p>Dear All,</p>\n<p>I hope this message finds you well.<br>\nI have a question regarding the metadata of the <strong>Dataverse itself</strong>. I am aware that dataset metadata can be customized through metadata blocks. However, in my case I would also like to know whether it is possible to customize the metadata of a Dataverse itself — for example, by adding new fields in addition to the default ones (Dataverse name, identifier, email, etc.).</p>\n<p>I could not find anything related to this in the official documentation. If this is not currently supported, do you know of any possible workarounds?</p>\n<p>Thank you in advance for your help.</p>\n<p>Best regards,<br>\nOussama</p>",
        "id": 536007275,
        "sender_full_name": "oussama Zoubia (UKK)",
        "timestamp": 1756122171
    },
    {
        "content": "<p>Hi! Currently you cannot add any additional fields to a collection (a dataverse). So far, people have added extra categories through a pull request. What fields did you have in mind?</p>",
        "id": 536129178,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1756166840
    },
    {
        "content": "<p>Hi Philip,</p>\n<p>Thanks for your reply. In our case, the Dataverse would correspond to a project, and want to add some extra information about it (e.g., type, members, etc.). Most of these would just be simple text fields.</p>\n<p>could you kindly refer me to any pull request you're aware of that managed to do such customization to the collection ? </p>\n<p>Thank you and best regards,</p>",
        "id": 536460593,
        "sender_full_name": "oussama Zoubia (UKK)",
        "timestamp": 1756313131
    },
    {
        "content": "<p>Sure, here's an example:</p>\n<p>adds \"Laboratory\" and \"Research Group\" to list of Dataverse categories <a href=\"https://github.com/IQSS/dataverse/issues/3070\">#3070</a></p>",
        "id": 536467852,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1756315853
    },
    {
        "content": "<p>Thank you so much i'll take a look</p>",
        "id": 537622000,
        "sender_full_name": "oussama Zoubia (UKK)",
        "timestamp": 1756975987
    }
]