[
    {
        "content": "<p>Hi all .. this is kind of a strange question, but wondering if anyone has any insight into ICPSR Turbo Curator inner workings? We are working on a project to try to determine the usefulness of ChatGPT for generating metadata for other applications that we support, similar to what Turbo Curator does. We are not trying to build anything or get dev secrets but just general info for how it works (ie: does it use OpenAI API?) and what the perceived usefulness of it is for datasets. For instance, do folks feel that it generates adequate keywords, description, etc.?  We would use this for a comparison to what our findings are in using it for our testing of some of our collection documents (not Dataverse). I've asked a few people individually but otherwise honestly do not know who else might know this info (specific to dataverse).</p>",
        "id": 454053972,
        "sender_full_name": "Deirdre Kirmis",
        "timestamp": 1721941492
    },
    {
        "content": "<p>Yes, it uses OpenAI.</p>\n<p>\"TurboCurator generates recommendations powered by OpenAI’s ChatGPT technology and ICPSR’s suggestion logic.\" -- <a href=\"https://turbocurator.icpsr.umich.edu/tc/adminabout\">https://turbocurator.icpsr.umich.edu/tc/adminabout</a></p>\n<p>Via <a href=\"https://guides.dataverse.org/en/6.3/admin/external-tools.html#inventory-of-external-tools\">https://guides.dataverse.org/en/6.3/admin/external-tools.html#inventory-of-external-tools</a></p>",
        "id": 454054949,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1721941927
    },
    {
        "content": "<p>Maybe one of their next steps could be enable usage of other providers? We're curious to use this, but we'd certainly want to use <a href=\"http://e1.pages.jsc.fz-juelich.de/2024-02-talk-lips-blablador\">Blablador</a> with it (e.g. using Llama 3.1 as one of the models offered), not OpenAI.</p>",
        "id": 454056952,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1721942857
    },
    {
        "content": "<p>I'm not sure if they are using a custom build RAG together with ChatGPT, which would probably increase the quality of generated keywords etc.</p>",
        "id": 454057156,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1721942957
    },
    {
        "content": "<p>ah thanks ..  i guess i meant, does it use the OpenAI API in a script on the server to make calls to chatgpt .. or does it use python sdk or something else? still trying to figure out where to start there ..<br>\nalso, just wondering if there is any stats on the user perception of how well it generates the title, description, keywords based on it's analysis of the dataset metadata .. does it get it right or miss some? we are trying to compare what chatgpt does vs what a human would do</p>",
        "id": 454063091,
        "sender_full_name": "Deirdre Kirmis",
        "timestamp": 1721946114
    },
    {
        "content": "<p>and I think \"Ask the Data\" probably is doing a similar thing? Sending the file to ChatGPT via API and results are sent back to the UI?</p>",
        "id": 454067884,
        "sender_full_name": "Deirdre Kirmis",
        "timestamp": 1721948929
    },
    {
        "content": "<p>Yes, if you look at the Ask the Data README at <a href=\"https://github.com/IQSS/askdataverse\">https://github.com/IQSS/askdataverse</a> you'll see that it also uses OpenAI.</p>",
        "id": 454295437,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1721999240
    },
    {
        "content": "<p>TurboCurator is so new I doubt anyone has done a proper study of its recommendations. However, Dataverse installations are encouraged to install it and try it as a first step. <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 454295660,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1721999320
    },
    {
        "content": "<p>Oh yea, that is super helpful! Sorry I missed that. I see they use LangChain which is something we were looking into as well. Thanks!</p>",
        "id": 454323849,
        "sender_full_name": "Deirdre Kirmis",
        "timestamp": 1722007700
    },
    {
        "content": "<p>Deirdre - I am Kelly Doonan-Reed the Product Owner from ICPSR that supports TurboCurator.  I consulted with my Technical Team today.  Adding the response from the team.</p>",
        "id": 454361663,
        "sender_full_name": "Kelly Doonan-Reed",
        "timestamp": 1722023985
    },
    {
        "content": "<p>TurboCurator is a web-based tool built using Azure’s version of Open AI’s Chat GPT that generates recommendations for title, summary and keywords.  We are using Azure’s learning model in OpenAI. We built basic prompts and focused on prompt engineering.  The team built prompts in Open AI’s Chat GPT to provide suggestions for Title, Summary &amp; Keywords.  Yes, we used Azure’s Open AI java libraries to create APIs that display recommendations in the TurboCurator UI.  Our prompt’s are based on ICPSRs best practices for metadata.</p>\n<p>In our testing of TurboCurator, we had to hone ChatGPT so that it was not too restrictive (did not generate any suggestions) or too creative (generated suggestions that did not make sense).</p>\n<p>For keywords recommendations in addition to building prompts, we added both pre-processing and post-processing. The pre-processing used a full text search to get candidate keywords from the ICPSR thesaurus and included in the prompt. The post-processing checks the validity of the keywords returned from the ChaptGPT API to prevent AI “hallucination” (creative recommendations). If an original keyword entry was included in the ICPSR Thesaurus we continue to display it even if ChatGPT dropped it.  </p>\n<p>The human user is presented with recommendations.  They can edit these recommendations and decide if they want to copy them back to their dataset.</p>\n<p>We are looking for feedback from TurboCurator users on the quality of suggestions generated.</p>\n<p>Please go ahead and play around and let us know what you think via the Provide feedback.  I am a fan of the <a href=\"https://demo.dataverse.org/\">Dataverse demo space</a> and it is a safe space to experiment with TurboCurator to learn more.   In the TurboCurator tool itself, check out the help for each metadata field to see how we generate its recommendations from ChatGPT, e.g., what rules we use to create a title recommendation.</p>\n<p>TurboCurator was featured during the <a href=\"https://harvard.zoom.us/rec/play/p0N-Q0xcOEKIgvqHM8Ix1YNt61DNJOpt5vRABryhqVR7Zhs2ZqcEKsMOdWS5hNMs5GFcl48KcVJJX_ft.-UJ_PnDmV8z2FT8X?canPlayFromShare=true&amp;from=share_recording_detail&amp;continueMode=true&amp;componentName=rec-play&amp;originRequestUrl=https%3A%2F%2Fharvard.zoom.us%2Frec%2Fshare%2F0a9L0tMXUK1lRlR4Y5Lx-AHIWD4JuhEtahohBsgQGoFauc5Ng2WjkdhxyuRZdBEq._GjWpzbwX1FqluZq\">[January DataverseTV]</a></p>",
        "id": 454361876,
        "sender_full_name": "Kelly Doonan-Reed",
        "timestamp": 1722024068
    },
    {
        "content": "<p>Other Resources:</p>\n<p><a href=\"https://turbocurator.icpsr.umich.edu/tc/adminabout\">Dataverse Administrator About TurboCurator</a></p>\n<p><a href=\"https://turbocurator.icpsr.umich.edu/tc/FAQ\">FAQ</a></p>\n<p><a href=\"https://turbocurator.icpsr.umich.edu/tc/feedback\">Provide Feedback</a></p>",
        "id": 454362072,
        "sender_full_name": "Kelly Doonan-Reed",
        "timestamp": 1722024127
    },
    {
        "content": "<p>Welcome, <span class=\"user-mention\" data-user-id=\"740182\">@Kelly Doonan-Reed</span> and thanks for the detailed response!</p>",
        "id": 454370525,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1722026524
    },
    {
        "content": "<p>Hi Kelly .. thank you so much for your response! This is a amazing information, and I appreciate it immensely. It is so very helpful to us. We are really just getting started on this journey and it is helpful to know how some other tools are utilizing models and building prompts, talking to Chat GPT, etc. </p>\n<p>We have spent some time messing around with building prompts and various ways to \"train\" the GPT to get more specific answers, etc. We have done some command line scripting to interact with it, but have a long way to go on that. A big challenge that we will face is that we would like the \"tool\" that we build to actually cycle through files in the repository and analyze them to provide metadata, but that does not seem to be an easy task! We are also wondering about accuracy and variations in those responses and how much human involvement will still be necessary.</p>\n<p>I did watch your Dataverse TV video and that was very helpful as well! The demo site has been very useful in testing things out as well and we do have Turbo Curator installed on our QA and Prod sites. Your pre-processing and post-processing steps are very interesting and seem most important .. I will check out the help in the fields and test it more. I will send some feedback on our experience soon. </p>\n<p>Again, thank you, thank you!</p>",
        "id": 454371635,
        "sender_full_name": "Deirdre Kirmis",
        "timestamp": 1722027063
    },
    {
        "content": "<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 454389955,
        "sender_full_name": "Kelly Doonan-Reed",
        "timestamp": 1722035585
    },
    {
        "content": "<p>Heard this episode today with Bruce Hopkins who also released a book recently on ChatGPT with Java. <a href=\"http://airhacks.fm\">airhacks.fm</a> podcast with adam bien: From J2ME, over Bluetooth and Speech Recognition to AI</p>\n<p>Webseite der Episode: <a href=\"http://airhacks.fm/\">http://airhacks.fm/</a></p>\n<p>Mediendatei: <a href=\"https://s3.eu-central-1.amazonaws.com/airhacks.fm/airhacksfm_304.mp3\">https://s3.eu-central-1.amazonaws.com/airhacks.fm/airhacksfm_304.mp3</a></p>",
        "id": 454486427,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1722094799
    },
    {
        "content": "<p>Here's the book: <a href=\"https://javachatgptbook.com/\">https://javachatgptbook.com/</a></p>",
        "id": 454486584,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1722094846
    }
]