[
    {
        "content": "<p>Hej everyone, <br>\nwe're currently implementing RAiD project identifiers (<a href=\"https://www.raid.org/\">https://www.raid.org/</a>) into RSpace and want to pass the identifier as deposit metadata to repositories, so that folks can find all the outputs of a given project using the RAiD ID. </p>\n<p>Are there any recommendations from the Dataverse community where to put RAiD IDs into the metadata? My first hunch would have been \"Other Reference\" but maybe there's something more suitable?</p>\n<p>Thank you! cheers, Tilo.</p>",
        "id": 563782978,
        "sender_full_name": "Tilo Mathes",
        "timestamp": 1765794070
    },
    {
        "content": "<p>Hi! Yeah, for now \"Other Reference\" sounds fine, I guess, but perhaps we should have a dedicated field.</p>\n<p>Here's the description according to <a href=\"http://raid.org\">raid.org</a>: \"The Research Activity Identifier (RAiD) is a persistent identifier (PID) and global registry dedicated to research projects.\"</p>\n<p>Are you interested in creating an issue? <a href=\"https://github.com/IQSS/dataverse/issues\">https://github.com/IQSS/dataverse/issues</a></p>",
        "id": 563819672,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1765804530
    },
    {
        "content": "<p>Thanks Phil, I'd probably revise my first hunch after looking at the DataCite metadata schema. There it is recommended to use the \"Related Identifier\" property with a corresponding relation (e.g. isPartOf or whatever makes most sense). I just noticed that \"Related Identifier\" in DataCite maps to \"Related Publication\" in dataverse, according to this crosswalk document: <a href=\"https://docs.google.com/spreadsheets/d/1VAhZ83hKURX_4T-bOkn7XCb9h62Gr2gcJI1fWe4Rl4c/edit?gid=0#gid=0\">https://docs.google.com/spreadsheets/d/1VAhZ83hKURX_4T-bOkn7XCb9h62Gr2gcJI1fWe4Rl4c/edit?gid=0#gid=0</a> . \"Related Publication\"  feels a bit 'off' but it would put the information in the right place wrt to DataCite. </p>\n<p>Happy to create an issue around this.</p>",
        "id": 563824267,
        "sender_full_name": "Tilo Mathes",
        "timestamp": 1765805707
    },
    {
        "content": "<p>Awesome. Thanks. Let me also ping <span class=\"user-mention\" data-user-id=\"621770\">@Julian Gautier</span> who thinks a lot about how to map to DataCite.</p>",
        "id": 563847555,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1765810994
    },
    {
        "content": "<p>Also, thanks for creating <a href=\"https://github.com/IQSS/dataverse/issues/12045\">#12045</a>!</p>",
        "id": 563849318,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1765811355
    },
    {
        "content": "<p>Hey all. Thanks for pinging me, Phil.</p>\n<p>Tilo, like you wrote, I agree that using \"Related Publication\" would put the information in the right place with regard to DataCite, but that \"Related Publication\" field is meant to describe articles and other text-based publications, and it sounds like what RAiD identifiers should be used for would not be articles or other text-based publications. I saw that you didn't mention the \"Related Publication\" field in the GitHub issue you opened at <a href=\"https://github.com/IQSS/dataverse/issues/12045\">https://github.com/IQSS/dataverse/issues/12045</a>, but I just wanted to help reply to that point here.</p>",
        "id": 563869528,
        "sender_full_name": "Julian Gautier",
        "timestamp": 1765816192
    }
]