[
    {
        "content": "<p>Is there any possibility to update a dataset file (a README file in my case), and to avoid to have a change of a major version?</p>\n<p>I think that in that case it doesn’t make sense because a README file is  more or less a metadata, and the data didn’t change…</p>\n<p>I would have liked to have changed only the minor version number (or without changing version).</p>",
        "id": 478705294,
        "sender_full_name": "odelaigue",
        "timestamp": 1729773136
    },
    {
        "content": "<p>We have also thought about this.</p>\n<p>E.g. for cases where the file is changed only because a typo within the file content has been fixed, a minor version increase might be enough.</p>\n<p>Based on my brief look at the code and some testing, I don't think it's possible though.</p>",
        "id": 478710026,
        "sender_full_name": "Vera Clemens",
        "timestamp": 1729774607
    },
    {
        "content": "<p>I'm afraid it isn't. Not for changes to the content of files. If the checksum (e.g. md5) has changed, we force a new version.</p>",
        "id": 478711692,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1729775076
    },
    {
        "content": "<p>There's somewhat related functionality if the typo is in a metadata field like \"description\". A superuser can fix it and republish without bumping the version using an \"Update Current Version\" button. Please see <a href=\"https://guides.dataverse.org/en/6.4/admin/dataverses-datasets.html#make-metadata-updates-without-changing-dataset-version\">https://guides.dataverse.org/en/6.4/admin/dataverses-datasets.html#make-metadata-updates-without-changing-dataset-version</a></p>",
        "id": 478711857,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1729775127
    },
    {
        "content": "<p>But again, for files, we force a major version change.</p>",
        "id": 478712022,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1729775169
    },
    {
        "content": "<p>Should we treat README files differently? Have different rules for them? <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 478712078,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1729775185
    },
    {
        "content": "<p>Thank you for your answer. Yes, I have seen that there is no problem about changing metadata without updating the version. <br>\nIn my opinion, the README file (or any explanation file, that is files that don't have the data) should be viewed as similar to metadata.<br>\nI think that is confusing to the users to upgrade the major version number when there is no change in the data (e.g. for a typo as said Vera Clemens previously).</p>",
        "id": 478713933,
        "sender_full_name": "odelaigue",
        "timestamp": 1729775706
    },
    {
        "content": "<p>Have you played with adding tags like code, data, or documentation to files? Maybe these could be signals to Dataverse to treat files differently.</p>",
        "id": 478715439,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1729776070
    },
    {
        "content": "<p>It seems to have the same result for all tag options. It forces for a major version change.</p>",
        "id": 478717178,
        "sender_full_name": "odelaigue",
        "timestamp": 1729776528
    },
    {
        "content": "<p>Yes, sorry, I mean in the future, as some sort of new feature.</p>",
        "id": 478717411,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1729776589
    },
    {
        "content": "<p>I think that it could be a very good solution! <br>\nIf the owner of the dataset uses a \"documentation\" tag for a file, he can then decide between major or minor version change.</p>",
        "id": 478718203,
        "sender_full_name": "odelaigue",
        "timestamp": 1729776796
    },
    {
        "content": "<p>Cool, I suspect it'll be a fair amount of work to implement this, though. You don't happen to have any developers who would want to poke around in this part of the code, do you? <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 478727450,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1729779199
    }
]