[
    {
        "content": "<p>Dear all,</p>",
        "id": 416052597,
        "sender_full_name": "Patrick Kibies",
        "timestamp": 1705504764
    },
    {
        "content": "<p>we at TU Dortmund are working on a Dataverse instance.  One of the question we still have, what the best way of virus checking on upload would be. We are aware of the possibility to implement a virus scanning step in a pre-publication workflow, but that would be a little bit too late, since unpublished data might also be shared between users having sufficient access. Has someone implemented a virus scan on upload, maybe using clamav. A completely different way could be to inspect the ingoing network traffic, but a solution within Dataverse,  producing a meaningful and understandable error message and as the icing on the cake an email alert to certain persons seems favorable...</p>",
        "id": 416054032,
        "sender_full_name": "Patrick Kibies",
        "timestamp": 1705505102
    },
    {
        "content": "<p>I'd like to exchange some opinions and ideas on this matter.</p>",
        "id": 416054267,
        "sender_full_name": "Patrick Kibies",
        "timestamp": 1705505166
    },
    {
        "content": "<p>Hi! Someone <a href=\"https://groups.google.com/g/dataverse-community/c/hnTE1y2ZIDk/m/vOnQOsVuCAAJ\">asked</a> a while ago on the mailing list. I'm not aware of any installation scanning files for viruses.</p>",
        "id": 416068465,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1705508505
    },
    {
        "content": "<p>You'll reach more people on the mailing list. You could consider asking there.</p>",
        "id": 416068618,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1705508533
    },
    {
        "content": "<p>Hi Philip, thanks! I'll reach out to the mailing list.</p>",
        "id": 416519533,
        "sender_full_name": "Patrick Kibies",
        "timestamp": 1705566422
    },
    {
        "content": "<p>Nothing yet but thanks for posting <a href=\"https://groups.google.com/g/dataverse-community/c/-HMXPNwTlqI/m/ulQZNNLTAgAJ\">https://groups.google.com/g/dataverse-community/c/-HMXPNwTlqI/m/ulQZNNLTAgAJ</a></p>",
        "id": 418699166,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1706554137
    }
]