[
    {
        "content": "<p>What differentiates Zulip from other similar products?</p>\n<p>For more context, please see <a class=\"stream-topic\" data-stream-id=\"375876\" href=\"/#narrow/channel/375876-zulip/topic/softwarereviews.2Ecom\">#zulip &gt; softwarereviews.com</a></p>",
        "id": 479981648,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1730424373
    },
    {
        "content": "<p>The most similar product, I suppose, is Slack.</p>",
        "id": 479982011,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1730424707
    },
    {
        "content": "<p>I like Slack fine for private team or department communication, but I don't think it's ideal for an open source project, where I believe in a lot of transparency.</p>",
        "id": 479982094,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1730424761
    },
    {
        "content": "<p>Zulip allows for \"web-public\" channels, which means that newcomers can read what we're talking about without signing up first.</p>",
        "id": 479982135,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1730424821
    },
    {
        "content": "<p>Back in the day, people would \"lurk\" around open source projects on mailing lists. These days, chat is also common. So let 'em lurk. Let 'em see what we're talking about. Hopefully, they'll join.</p>",
        "id": 479982198,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1730424865
    },
    {
        "content": "<p>Another differentiator that comes to mind for me is that as a keyboard junkie, Zulip has a keyboard shorcut for practically everything. I very rarely need to reach for a mouse.</p>",
        "id": 479982239,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1730424929
    },
    {
        "content": "<p>Zulip is open source, so I feel much more able to learn about where the product is going and even contribute a bit (see <a class=\"stream-topic\" data-stream-id=\"375876\" href=\"/#narrow/channel/375876-zulip/topic/first.20PR.20to.20Zulip\">#zulip &gt; first PR to Zulip</a>). I chat with the Zulip core team at <a href=\"https://chat.zulip.org\">https://chat.zulip.org</a> and I feel listened to. (I recommend the #feedback channel, by the way.)</p>",
        "id": 479982416,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1730425073
    },
    {
        "content": "<p>Within channels, Zulip encourages you to talk within topics. This is a major differentiator. It keeps discussion much more organized than most chat apps such as Slack.</p>\n<p>Yes, it's a little more work up front to type a few words about what you want to talk about (like typing the subject of an email), but it's worth it. You'll spend more time reading than writing anyway, so you can skip the topics that don't interest you.</p>",
        "id": 480028942,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1730456820
    },
    {
        "content": "<p>People who are new to Zulip sometimes simply reply to whatever the latest message is. That's fine. We can simply move the message to its own dedicated topic.</p>",
        "id": 480029031,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1730456881
    }
]