[
    {
        "content": "<p>Hi all,</p>\n<p>We would like to migrate some datasets from one Dataverse instance to another. (So these are separate installations.) We would like to preserve the DOI (of course!), but the instances have different DOI prefixes. I tried the <a href=\"https://guides.dataverse.org/en/6.2/developers/dataset-migration-api.html\">Migrate API</a> in a test environment, and this only worked if the PID in the JSON file has the same Prefix.  This is as indicated in the docs.</p>\n<p>\" existing publication dates and PIDs are maintained (currently limited to the case where the PID can be managed by the Dataverse software, e.g. where the authority and shoulder match those the software is configured for)\" </p>\n<p>But I was wondering, since Dataverse now supports multiple PID providers, would the migration API  work if we added the other DOI prefix (not as default, but as a second PID provider)? <br>\nCan you add DataCite twice as a PID provider, but with a different prefix?</p>\n<p>Any thoughts or advice?</p>\n<p>Laura</p>",
        "id": 472875754,
        "sender_full_name": "Laura Huis in 't Veld",
        "timestamp": 1727350794
    },
    {
        "content": "<p>You should be able to add DataCite twice with different prefixes.</p>",
        "id": 472881224,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1727352530
    },
    {
        "content": "<p>I'm not sure about the migration question. <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 472881268,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1727352547
    },
    {
        "content": "<p>A cleaner solution might be migrating the data under the new prefix and changing the old entry at DataCite to forward to the new location</p>",
        "id": 472967802,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1727382011
    },
    {
        "content": "<p>You can add multiple DataCite prefixes, but the two instances shouldn't be able to fight over the authority</p>",
        "id": 472967903,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1727382055
    },
    {
        "content": "<p>We will go for the solution Oliver mentioned. That was on our list of options already, but  I wanted to check if another option would be better. </p>\n<p>Thanks!</p>\n<p>(I do not have permission to 'solve' this topic, btw)</p>",
        "id": 474815681,
        "sender_full_name": "Laura Huis in 't Veld",
        "timestamp": 1728046066
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"713266\">Laura Huis in 't Veld</span> has marked this topic as resolved.</p>",
        "id": 474839370,
        "sender_full_name": "Notification Bot",
        "timestamp": 1728053267
    }
]