[
    {
        "content": "<p>Hello, </p>\n<p>We are using v 6.6 and noticed a weird issue this morning. </p>\n<p>Someone created a dataset and uploaded and published a dataset in it over the weekend. I can see the dataverse and it doesn't have anything in it.  Then the user gave me a link to a dataset that's published, which renders just fine. In the GUI it's under the dataverse  in question.  It's not clear to me why the dataverse screen doesn't list the dataset. </p>\n<p>The dataset itself is published and appears to be public, but might it be in some other state?   Why would it not show up in the dataverse it's a part of?   </p>\n<p>I did reindex the specific dataverse in question earlier, but that didn't appear to help.   Do I need to reindex everything?   </p>\n<p>What tipped me off to this is that the user is getting \"unauthorized\" errors when they try to edit the dataset, but they do have access to the dataset, via the Dataverse (inherited).  </p>\n<p>It seems like something disconnected this dataset from it's parent... any ideas/suggestions? </p>\n<p>Thanks!</p>",
        "id": 572889911,
        "sender_full_name": "Bethany Seeger",
        "timestamp": 1770672429
    },
    {
        "content": "<p>I can see in the action log that someone did get a private URL for the record, but then subsequently published the dataset (edu.harvard.iq.dataverse.engine.command.impl.FinalizeDatasetPublicationCommand) in quick succession -- could that cause issues?</p>\n<p><a href=\"/user_uploads/53090/-lTmTpI1cmQXjejMIwJJQUil/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/53090/-lTmTpI1cmQXjejMIwJJQUil/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"1188x511\" src=\"/user_uploads/thumbnail/53090/-lTmTpI1cmQXjejMIwJJQUil/image.png/840x560.webp\"></a></div>",
        "id": 572890673,
        "sender_full_name": "Bethany Seeger",
        "timestamp": 1770672625
    },
    {
        "content": "<p>Reindexing the collection doesn't reindex the dataset. What if you reindex the dataset? Does that help?</p>",
        "id": 572891415,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1770672870
    },
    {
        "content": "<p>Hi Philip, no, that didn't help, but in checking the solr log I'm realizing the schema may be incomplete and that this dataset has a field that's not in the schema.xml file, but should be.  I'll try to fix that and reindex.  I suspect that is the issue.</p>",
        "id": 572898676,
        "sender_full_name": "Bethany Seeger",
        "timestamp": 1770675656
    },
    {
        "content": "<p>sounds likely <span aria-label=\"smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 572898965,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1770675786
    }
]