[
    {
        "content": "<p>Hello, <br>\nI hope I'm writing on the right channel,<br>\nI need to upload data to a dataverse db (Max Plank Edmond) I have a json file (that I can change to a csv) of values that describe the experiment/file I'm uploading, I want to be able to search the files I've uploaded based on those values,</p>\n<p>I saw that if I upload a csv its is translated into tabular data (variables?) can I use the API to search using these values ?</p>\n<p>Or what is the right way to add fields that describe my data (if it is possible)</p>\n<p>Thanks<br>\nNir Harel</p>",
        "id": 493620701,
        "sender_full_name": "Nir Harel",
        "timestamp": 1736871370
    },
    {
        "content": "<p>Yes, if the CSV is successfully ingested, the column names will be searchable. However, the values won't be.</p>\n<p>To make data files searchable generally, you should turn on full text indexing. Here's how: <a href=\"https://guides.dataverse.org/en/6.5/installation/config.html#solrfulltextindexing\">https://guides.dataverse.org/en/6.5/installation/config.html#solrfulltextindexing</a></p>",
        "id": 493622966,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1736872061
    },
    {
        "content": "<p>There is no way to use an api to access/search the values of the fields, or create similar custom searchable values ?</p>",
        "id": 493623980,
        "sender_full_name": "Nir Harel",
        "timestamp": 1736872352
    },
    {
        "content": "<p>Well, searching and accessing are different. I was talking about searching. You want to access the JSON file? (Or CSV if you switch format?) You can certainly download any file you upload.</p>",
        "id": 493624473,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1736872491
    },
    {
        "content": "<p>As for describing a data file, you could upload an auxiliary file or two to describe it: <a href=\"https://guides.dataverse.org/en/6.5/developers/aux-file-support.html\">https://guides.dataverse.org/en/6.5/developers/aux-file-support.html</a></p>",
        "id": 493625679,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1736872831
    },
    {
        "content": "<p>If you look at <a href=\"https://demo.dataverse.org/dataverse/demo/search\">https://demo.dataverse.org/dataverse/demo/search</a> and scroll down to \"Files\" you see that ordinarily, only a few field are searchable for files: name, description, file type, etc. This is all metadata about files we keep in the database.</p>\n<p>That \"full text indexing\" feature I mentioned is our main way of making the content of the file searchable (via the UI and API).</p>",
        "id": 493626197,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1736872977
    },
    {
        "content": "<p>I hope this is helping! <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> Please keep the questions coming.</p>",
        "id": 493626250,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1736872994
    },
    {
        "content": "<p>Thanks, it helps but I still need to find a way to search by values that describe the files (I have about 20 values that describe each file) can you think of an option to make that possible (from what I understand - the aux file content is not searchable) or is my only option is full text search</p>\n<p>Thanks for the help</p>",
        "id": 493897454,
        "sender_full_name": "Nir Harel",
        "timestamp": 1736938471
    },
    {
        "content": "<p>Right, the aux file are not searchable.</p>",
        "id": 493916852,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1736944810
    },
    {
        "content": "<p>Really, the only way to make the contents of the file searchable is through full text indexing.</p>\n<p>A small exception to this is that the \"variable name\" (column name) and \"variable label\" (column description) of ingested tabular files are searchable without having full text indexing enabled.</p>",
        "id": 493917352,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1736944964
    },
    {
        "content": "<p>One thought: would you have any interest in adding some sample data to <a href=\"https://github.com/IQSS/dataverse-sample-data\">https://github.com/IQSS/dataverse-sample-data</a> ? We use this repo for testing.</p>",
        "id": 493917493,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1736945012
    }
]