[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"660583\">@Dieuwertje Bloemen</span> hi, I just noticed your <a href=\"https://groups.google.com/g/dataverse-community/c/wxtGvcpXWHU/m/hbbAFLAFBwAJ\">email</a> about access requests in a collection.</p>\n<p><span class=\"user-mention\" data-user-id=\"598442\">@Guillermo Portas</span> and I have been thinking hacking on the Notifications API as part of <a href=\"https://github.com/IQSS/dataverse/issues/11673\">#11673</a>, mostly because the SPA needs a better API to display in-app notifications.</p>\n<p>It sounds like you're interested in filtering notifications down to a particular collection. Is that right?</p>",
        "id": 533109315,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1754488604
    },
    {
        "content": "<p>I think that might be useful. It doesn't entirely cover the need, because you can't see what the status is at the moment of query. Though I'm gonna look how far I can get with the get notifications API call, wasn't aware that existed actually. It'll at least get me an overview of all requests ever sent. Thanks!</p>",
        "id": 533117421,
        "sender_full_name": "Dieuwertje Bloemen",
        "timestamp": 1754490965
    },
    {
        "content": "<p>Yes, please do take a look! There's also a dedicated topic on it: <a class=\"stream-topic\" data-stream-id=\"379673\" href=\"/#narrow/channel/379673-dev/topic/Notifications.20API.20usage.20and.20future/with/531389398\">#dev &gt; Notifications API usage and future</a></p>",
        "id": 533117572,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1754491011
    },
    {
        "content": "<p>I have at some point used a copy and paste of my notifications to calculate number of datasets that went through more than one review phase. So, there is some potential to grab some statistics more reliably from this API potentially. But of course, I don't actually think that that's the best data to do this kind of stuff with <span aria-label=\"working on it\" class=\"emoji emoji-1f6e0\" role=\"img\" title=\"working on it\">:working_on_it:</span></p>",
        "id": 533117980,
        "sender_full_name": "Dieuwertje Bloemen",
        "timestamp": 1754491138
    },
    {
        "content": "<p>Right, there's also this API, but you pass a file rather than a collection: <a href=\"https://guides.dataverse.org/en/6.7.1/api/dataaccess.html#list-file-access-requests\">https://guides.dataverse.org/en/6.7.1/api/dataaccess.html#list-file-access-requests</a></p>",
        "id": 533118986,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1754491431
    },
    {
        "content": "<p>Yeah, even if that one existed for a dataset, that would be great. But my ideal use case would be pretty much that call, but it gives the status for all access requests to any dataset/file of a collection. Maybe even with a parameter to say if you want the information on a dataset level or a file level (but just file level, would already be great).</p>",
        "id": 533119531,
        "sender_full_name": "Dieuwertje Bloemen",
        "timestamp": 1754491612
    },
    {
        "content": "<p>I'm sure the SPA will need something like that. <a href=\"https://github.com/IQSS/dataverse-frontend/issues/163\">https://github.com/IQSS/dataverse-frontend/issues/163</a> is related.</p>",
        "id": 533120244,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1754491821
    },
    {
        "content": "<p>It's not in the <a href=\"https://docs.google.com/document/d/1v0JO15RxojLyUNuiLeUGgON3Z_5VndKUj3r1kwT2e9w/\">SPA 2025 Q3 proposal</a>, though. Via <a href=\"https://github.com/IQSS/dataverse-pm/issues/421\">https://github.com/IQSS/dataverse-pm/issues/421</a></p>",
        "id": 533120834,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1754491996
    },
    {
        "content": "<p>Wouldn't hurt to create an issue though, a feature request, so that we consider it when building the APIs the SPA will need to manage access requests.</p>",
        "id": 533121070,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1754492060
    },
    {
        "content": "<p>I first wanted to see if anyone else has a similar/adjacent need. Or maybe has some workaround for this kinda thing. If not, I'll definitely create an feature request for it.</p>",
        "id": 533121577,
        "sender_full_name": "Dieuwertje Bloemen",
        "timestamp": 1754492220
    },
    {
        "content": "<p>Cool. Also, I brought this up at standup just now, to raise awareness.</p>",
        "id": 533127075,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1754494019
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"660583\">@Dieuwertje Bloemen</span> , I recently received a similar request from one of our users. He wanted to have an overview of all users who have requested access to restricted files in the past for a particular collection and all sub-collections. <br>\nThe Privacy Officer of this organisation recommended to maintain a local record of all individuals who have requested access to restricted files, particularly in the context of anonymised datasets.<br>\nI guess in this case you would also like to have info about if access was granted or not.</p>",
        "id": 534486534,
        "sender_full_name": "Laura Huis in 't Veld",
        "timestamp": 1755179024
    },
    {
        "content": "<p>We store \"REJECTED\" in the database but we don't expose it via the UI or API. Please see this issue: <a href=\"https://github.com/IQSS/dataverse/issues/8013\">#8013</a></p>",
        "id": 534487072,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1755179246
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"713266\">@Laura Huis in 't Veld</span> , we do keep a spreadsheet of all the access requests we've processed and their relevant DTA's (also at the advice of our privacy officer for GDPR compliance and stuff ;) ). But my main concern is that maybe we're sometimes missing access requests due to a manual oversight. Or someone forgot to log a specific granting or rejecting. It would be nice to easily get an overview of all access requests of the collection (and their status is a bonus) to then match against our internal list of the ones we've processed. It's mainly because I don't want to miss any requests (and keep requesters hanging) and I feel like the manual tracking just leaves room for too many errors. At least my gut currently says we've missed some, but I don't have an easy way to check if we actually did. My colleagues noted they could pull it from the database, but I think many installations would like a more easy way of quickly pulling such a link (e.g. to populate an excel with via an api call).</p>",
        "id": 534495100,
        "sender_full_name": "Dieuwertje Bloemen",
        "timestamp": 1755181837
    },
    {
        "content": "<p>Yeah, I feel like <a href=\"https://github.com/IQSS/dataverse/issues/8013\">#8013</a> should be retitled. Instead of <code>request access: when a user requests access to a file and is rejected, that action should be saved</code> it should explain that we want the data via API, at least.</p>",
        "id": 534496741,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1755182359
    },
    {
        "content": "<p>I've just created a feature request <a href=\"https://github.com/IQSS/dataverse/issues/11746\">#11746</a>. I'll also discuss it internally to see if maybe we can work on such an API call to get access requests on collection level.</p>",
        "id": 534497145,
        "sender_full_name": "Dieuwertje Bloemen",
        "timestamp": 1755182436
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"660583\">@Dieuwertje Bloemen</span> looks great. I edited it to link to the older, related issue. And I gave that old issue a better title, by the way. Longer but I hope better. <span aria-label=\"smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 534498245,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1755182714
    }
]