[
    {
        "content": "<p>UVa upgraded from 5.14 to 6.2 yesterday and I noticed (assuming because of the geospatial metadata block update) one of our datasets had a \"Incomplete Metadata Tag\". I just happened to see that one and fixed it - it was because of lat/long in geospatial block.</p>\n<p>How do I find other datasets that might have \"incomplete metadata\"?</p>",
        "id": 444688296,
        "sender_full_name": "Sherry Lake",
        "timestamp": 1718367645
    },
    {
        "content": "<p>You might be hitting this: \"Incomplete metadata\" label on published datasets <a href=\"https://github.com/IQSS/dataverse/issues/10116\">#10116</a></p>",
        "id": 444691325,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1718368696
    },
    {
        "content": "<p>Can you say more about the lat/long? It was incomplete?</p>",
        "id": 444699366,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1718371253
    },
    {
        "content": "<p>On a related note, someone asked, \"However, we do not know how to find the datasets affected in order to be able to correct them. Is there any feature for this?\" in this issue:</p>\n<p>Datasets labeled with \"Incomplete metadata\" due to invalid geospatial bounding box quietly disappear in search results <a href=\"https://github.com/IQSS/dataverse/issues/10526\">#10526</a></p>",
        "id": 444699696,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1718371357
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"598112\">@Philip Durbin</span>  Yes... this is what I am seeing, and the answer to my question \"how can I find others\".... is ....\"not easy to find the affected datasets\"</p>\n<p>I'll try to see if I can at least find the datasets that have used the geospatial metadata block by searching the DB.</p>",
        "id": 444707166,
        "sender_full_name": "Sherry Lake",
        "timestamp": 1718373645
    },
    {
        "content": "<p>So for the dataset that was incomplete... did it only have some of the four field for the bounding box?</p>",
        "id": 444707757,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1718373819
    },
    {
        "content": "<p>Yes, there were only two fields filled in. I made a note of what was there and then removed the values -  then, republished of course.</p>",
        "id": 444772450,
        "sender_full_name": "Sherry Lake",
        "timestamp": 1718392938
    }
]