[
    {
        "content": "<p>Hi, </p>\n<p>I see the great information about Harvard's system setup for Dataverse system in the guide[1].  I was wondering if anyone had a recommendation for the Java Opts -Xmx setting?  I think ours is currently too low and we're hitting issues maxing out the heap memory, but I'm not sure what a good setting for that would be relative to the overall memory the machine has. </p>\n<p>Any thoughts welcome.  <br>\nThanks!<br>\nBethany<br>\n[1]https://guides.dataverse.org/en/latest/installation/prep.html</p>",
        "id": 492797591,
        "sender_full_name": "Bethany Seeger",
        "timestamp": 1736449638
    },
    {
        "content": "<p>Hello,</p>\n<p>I tried to reply to you last week but was unable to send in Zulip. Our integration testing runs in a single VM with 8GB of RAM with a 4GB JVM heap (Xmx) as a functional minimum. The current PrimeFaces front-end consumes 10MB of memory for each session (authenticated or not) and tabular ingest can consume up to 10 times the filesize in RAM, depending on the format. UNC Dataverse, for reference, runs in a VM with 64GB of RAM and a 48GB JVM heap. With heavy caching we routinely max that out.</p>\n<p>I hope this helps?<br>\nDon</p>",
        "id": 493961917,
        "sender_full_name": "Don Sizemore",
        "timestamp": 1736957153
    },
    {
        "content": "<p>Thanks, Don, this is very helpful. </p>\n<p>Hi Don, </p>\n<p>Thank you - this information helps a lot!</p>\n<p>I think we were running way low for what we needed.  We had given the JVM 3.8 GB for the heap but just upped that to 8GB for the HEAP and 32GB for the system in total. I suspect we need to up the heap value more, as I'm not sure how well this will handle under load. </p>\n<p>That's really good to know about the TAB ingest. We had a user upload about 1000 small CSV files (in one zip) that got converted to TAB - it took our server down with all the processing.  Eventually I just had them upload it via direct upload as zip files instead.  They were content with that and didn't want the TAB files anyways.<br>\nBest,<br>\nBethany</p>",
        "id": 494012072,
        "sender_full_name": "Bethany Seeger",
        "timestamp": 1736973547
    }
]