[
    {
        "content": "<p>Hi All .. for anyone running Rocky Linux 8 .. we keep getting notifications from our scanner that we have CVE vulnerabilities for things that have long been patched. Is anyone else seeing this just from Rocky Linux? We are running the subscription from AWS and patch monthly, and run security patches every other 2 weeks. If I search the RPM log I can see \"resolved\" for each of the specified vulns. I believe the scanners likely just look at the package version and aren't able to see backport patches, but is there any way to send that info to the scanner, or at least keep the scanner from seeing the package version? How do other orgs handle this? Are you upgrading to Rocky 9?</p>",
        "id": 572916085,
        "sender_full_name": "Deirdre Kirmis",
        "timestamp": 1770683915
    },
    {
        "content": "<p>In researching this I see that Rocky/RHEL backport fixes without changing upstream versions, whereas Ubuntu increments package versions when fixing CVEs .. most of our systems are Ubuntu, so we don't have this happen with any of our other systems .. I want to keep with the recommended OS so just wondering if anyone comes across this and how do you manage it? (ie: just submit false positives with justification)?</p>",
        "id": 572920477,
        "sender_full_name": "Deirdre Kirmis",
        "timestamp": 1770686229
    },
    {
        "content": "<p>and answering my own question .. sometimes you can configure the scanner to use vendor advisories instead of package versions</p>",
        "id": 572925822,
        "sender_full_name": "Deirdre Kirmis",
        "timestamp": 1770689260
    },
    {
        "content": "<p>My expertise is seriously out-of-date, having not used security scanning tools in probably 15 years, but, yes, I feel like back then anyway some tools would only look at version numbers. A vendor like Red Hat would backport fixes but the scanning tool sometimes couldn't tell.</p>",
        "id": 573062973,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1770734954
    },
    {
        "content": "<p>Yea i found this: <a href=\"https://access.redhat.com/security/updates/backporting\">https://access.redhat.com/security/updates/backporting</a><br>\n.. which I think explains it, and Ubuntu does increment the version of the package so we don't get these false positive security notices from those systems .. but just curious if others doing scanning just submit justifications continuously for these? I guess there is a way to configure the scanner to look at advisories on the system instead of package versions but our SOC team would have to be aware and do that, as they control the scanner. I likely should look into migrating to Ubuntu but really want to stay with the supported OS. Anyway, thanks for the input.</p>",
        "id": 573071281,
        "sender_full_name": "Deirdre Kirmis",
        "timestamp": 1770736817
    }
]