[
    {
        "content": "<p>Hello, </p>\n<p>We are working on a custom metadata block where we've had to change the key/value of some controlled terms in it a few times.   This is in our test environment. </p>\n<p>There are points where we've changed the controlled vocabs key and I suspect the old  original key/value set is still in the database, as we are still seeing the old values in the UI as options. </p>\n<p>I think I need to do some database cleanup. Is that the best way to address this? </p>\n<p>I see these tables... are there others I need to touch? datasetfield_controlledvocabularyvalue<br>\ncontrolledvocabularyvalue</p>\n<p>Also, would having an identifier on these terms have helped prevent the duplication?  (we didn't have an identifer, but could add them)</p>\n<p>Thanks!<br>\nBethany</p>",
        "id": 520705874,
        "sender_full_name": "Bethany Seeger",
        "timestamp": 1748362362
    },
    {
        "content": "<p>I don't have any concrete suggestions apart from how <a href=\"https://guides.dataverse.org/en/latest/schemaspy/\">https://guides.dataverse.org/en/latest/schemaspy/</a> might help you understand the datatabase schema. Be sure to look at the one for your version such as <a href=\"https://guides.dataverse.org/en/6.6/schemaspy/\">https://guides.dataverse.org/en/6.6/schemaspy/</a></p>",
        "id": 520729927,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1748367873
    },
    {
        "content": "<p>Thanks, Phil!   That schemaspy is superhelpful. Definitely doing a db backup before hand!</p>",
        "id": 520732169,
        "sender_full_name": "Bethany Seeger",
        "timestamp": 1748368697
    },
    {
        "content": "<p>Do you know if having identifiers would have helped us here? I suspect it might have, but am not sure how the code adds metadata blocks.</p>",
        "id": 520742740,
        "sender_full_name": "Bethany Seeger",
        "timestamp": 1748372645
    },
    {
        "content": "<p>I think so but I'm not 100% sure. I do believe the identifiers are there for just this reason. Just a number like 7 or whatever that doesn't change while the string changes.</p>",
        "id": 520752557,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1748376815
    },
    {
        "content": "<p>Thanks - do the identifiers just need to be unique among the controlled vocab or all vocabs?   I'm guessing just the one they are apart of?</p>",
        "id": 520761007,
        "sender_full_name": "Bethany Seeger",
        "timestamp": 1748380582
    },
    {
        "content": "<p>Should be just the ones they're part of.</p>",
        "id": 520762693,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1748381502
    }
]