[
    {
        "content": "<p>Hi all,<br>\nI am currently working on updating a custom metadata block. Specifically I would like to modify a controlled vocabulary.  Usually the steps to do that are:</p>\n<ol>\n<li>Pass the updated metadata block to Dataverse via the <code>/api/admin/datasetfield/load</code> API endpoint</li>\n<li>Update the SOLR schema using the <a href=\"http://update-fields.sh\">update-fields.sh</a> script and reloading the schema</li>\n</ol>\n<p>First Question: Am I right to assume that if I only add an entry to my controlled vocabulary, I can skip step 2, since the SOLR schema isn't affected by this?</p>\n<p>Second (unrelated) Question: Assuming, purely hypothetically of course, that I want to fix a typo in the Value column of a controlled vocabulary entry. What is the safest way to do so? I have only used the Value column and have not used identifiers for the CV entries. Is that what identifiers are for or should I have used identifiers in the first place so that I could now edit the Values instead?</p>",
        "id": 406308876,
        "sender_full_name": "Henning Timm",
        "timestamp": 1701870543
    },
    {
        "content": "<p>Yes, you're right about the first point. You can skip it.</p>",
        "id": 406310497,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1701870924
    },
    {
        "content": "<p>For fixing typos, if it's a typo in a block we ship, you should open a pull request of course! For a custom block, I would maybe edit the database?</p>",
        "id": 406310777,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1701871003
    },
    {
        "content": "<p>I fear if you simply load it again you'll have two values: one with a typo and one without.</p>",
        "id": 406310838,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1701871026
    },
    {
        "content": "<p>You're very welcome to open an issue about this. At the very least we should document what to do.</p>",
        "id": 406310897,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1701871048
    },
    {
        "content": "<p>Thanks for the fast reply :)<br>\nThe typo is my fault alone and in my custom block. I will open an issue about this.</p>",
        "id": 406313982,
        "sender_full_name": "Henning Timm",
        "timestamp": 1701871873
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 406321155,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1701874058
    }
]