[
    {
        "content": "<p>The final open call for financial (Route 2) support will be open for applications from 9th October-4th December 2024.</p>\n<p>Applicants can apply to join the following support actions:</p>\n<ul>\n<li>1: Managing data types, schemas and vocabularies and crosswalks for FAIR researcher related metadata. Successful applicants will receive 5000 € to support their participation.</li>\n<li>2: Creating EOSC compliant interoperability policies based on EOSC Interoperability Framework (IF). Successful applicants will receive 5000 € to support their participation.</li>\n<li><strong>3: Testing the trustworthy and FAIR-enabling repositories prototype. Successful applicants will receive 5000 € to support their participation.</strong></li>\n<li>4: Implementation of a shared API for semantic catalogues. Successful applicants will receive 8000 € to support their participation.</li>\n</ul>\n<p><strong>Who can apply ?</strong><br>\nThis call is open to individuals, groups or organisations from public and private research-performing organisations, including:</p>\n<ul>\n<li>Research-performing organisations and research infrastructures;  </li>\n<li>Repositories, data and metadata service providers; </li>\n<li>Representatives of national and international level initiatives. </li>\n</ul>\n<p>Applicants must reside and/or work in an <strong>EU or <a href=\"https://ec.europa.eu/info/funding-tenders/opportunities/docs/2021-2027/common/guidance/list-3rd-country-participation_horizon-euratom_en.pdf\">Associated Country</a></strong> for the duration of the grant. A key aim for FAIR-IMPACT is to prioritise support for organisations, groups, and/or individuals based in countries or representing domains that are currently less advanced in terms of their FAIR enabling capacity2.</p>\n<p>The call is <strong>not</strong> open to individuals or groups based at any of the <a href=\"https://fair-impact.eu/partners\">FAIR-IMPACT project partner</a> organisations nor to individuals who hold the status of FAIR Champions under FAIR-IMPACT.</p>\n<p><a href=\"https://fair-impact.eu/events/fair-impact-events/fair-impacts-final-open-call-financial-support\">A webinar to showcase the support actions on offer and grant platform open for applications is planned 09 October 2024 14-15 CEST</a></p>\n<p>More info : <a href=\"https://fair-impact.eu/3rd-open-call-route-2-support-opens-30-sept\">https://fair-impact.eu/3rd-open-call-route-2-support-opens-30-sept</a></p>",
        "id": 475267743,
        "sender_full_name": "Dimitri Szabo",
        "timestamp": 1728297638
    },
    {
        "content": "<p>KU Leuven will likely be applying for number 3. It's a follow-up on one we did previously, if I remember correctly.</p>",
        "id": 478942857,
        "sender_full_name": "Dieuwertje Bloemen",
        "timestamp": 1729870463
    }
]