[
    {
        "content": "<p><em>Posting in <code>containers</code> but if <code>dev</code> is more appropriate, please feel free to move this.</em></p>\n<p>Dear all, I’ve been working on the Dataverse Action and have improved its structure and functionality. Previously, it wasn’t possible to gather logs because the action was composite-based and couldn’t run post actions. This implementation migrates to a Node-based backend, which allows post actions and, in my opinion, offers a more flexible solution.</p>\n<p>Another addition is the ability to enable S3 storage, currently limited to LocalStack. This feature provides two options:</p>\n<ul>\n<li>Provide the raw JVM arguments.</li>\n<li>Use pre-defined presets like <code>localstack</code>.</li>\n</ul>\n<p>The implementation of this feature has been quite challenging. The MicroProfile directory-based approach previously implemented didn’t work unfortunately. <span class=\"user-mention\" data-user-id=\"598183\">@Oliver Bertuch</span> I’m not an expert in Payara, but it seems that the Dataverse instance doesn’t recognize the <code>secrets</code>. Currently, I simply manipulate the compose YAML at runtime, which may not be the most elegant solution, but it works.</p>\n<p>I’ve added tests to verify the addition of JVM arguments and a small Python test suite to ensure that functionalities like S3 storage are functioning correctly.</p>\n<p>It would be great if someone could review this, as I’d like to update the action for use in my other libraries, which partially depend on S3 uploads. Leaving it untested in the CI doesn’t feel right.</p>\n<p>Here’s the pull request:</p>\n<p><a href=\"https://github.com/gdcc/dataverse-action/pull/18\">https://github.com/gdcc/dataverse-action/pull/18</a></p>",
        "id": 543712173,
        "sender_full_name": "Jan Range",
        "timestamp": 1759919657
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"598112\">@Philip Durbin 🚀</span> - <span class=\"user-mention\" data-user-id=\"599841\">@Jan Range</span> and I want to chat about this in ~20-30 minutes. Do you want in?</p>",
        "id": 544159600,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1760099840
    },
    {
        "content": "<p>Sure! Is it too late?</p>",
        "id": 544165685,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1760101674
    },
    {
        "content": "<p><a href=\"https://fz-juelich-de.zoom-x.de/j/61896738935?pwd=gwP8O5bc4z6ZgOgb7Db57QAFEx0YxT.1\">https://fz-juelich-de.zoom-x.de/j/61896738935?pwd=gwP8O5bc4z6ZgOgb7Db57QAFEx0YxT.1</a></p>",
        "id": 544166338,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1760101860
    }
]