[
    {
        "content": "<p>So Bitnami stopped their Helm Charts to be open and free. Now I need to decide if I want to use Apache Solr Operator (which means having to use SolrCloud and make Dataverse use it) or run something brewed locally.</p>",
        "id": 553384876,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1762177654
    },
    {
        "content": "<p>Any opinions?</p>",
        "id": 553384912,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1762177663
    },
    {
        "content": "<p>Sounds like a tough choice. Are you saying we have a choice between switching to SolrCloud and becoming the maintainers of a Solr Operator?</p>",
        "id": 553388107,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1762178504
    },
    {
        "content": "<p>Oh gosh, no! It's only that the Apache Solr folks only have an official Helm Chart for SolrCloud and their Solr Operator maintained. Running single instances or \"classic HA mode\" is not something they support. So if you want that, you must use something else. And that means either build yourself or reuse something.</p>",
        "id": 553388480,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1762178601
    },
    {
        "content": "<p>I suppose these days it would be wise to start looking into SolrCloud. If running on K8s, that's the way to go with redundancy, load balancing etc.</p>",
        "id": 553388617,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1762178634
    },
    {
        "content": "<p>So you're saying that Solr maintains an operator for SolrCloud but not Solr the way we run it. We'd become the maintainers of a Solr Operator for single instances. Do I have that right?</p>",
        "id": 553389103,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1762178764
    },
    {
        "content": "<p>Yeah, if we actually would like to go that way, we'd need to create either an operator or an Helm chart of our own.</p>",
        "id": 553389274,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1762178809
    },
    {
        "content": "<p>There are obviously already some charts out there and you could even fork some stuff, but as always: one needs to own their dependencies unless there is a community that takes care of it.</p>",
        "id": 553389458,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1762178856
    },
    {
        "content": "<p>If we switch to SolrCloud, we'd watch to switch everywhere, right? In dev, in a \"classic\" installation of Dataverse, etc.</p>",
        "id": 553389722,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1762178924
    },
    {
        "content": "<p>Not necessarily. It may be possible to do a parallel approach.</p>",
        "id": 553389958,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1762178966
    },
    {
        "content": "<p>I don't have much experience, so I am relying on good prompting with Claude 4.5 and testing later. It seems with what we have, we mostly would need to use a different client implementation. That's easy to switch depending on a setting.</p>",
        "id": 553390214,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1762179030
    },
    {
        "content": "<p>interesting</p>",
        "id": 553390261,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1762179042
    },
    {
        "content": "<p>I'm already asking for ideas what else could be optimized and it is mostly saying that we can do larger batches at a time because we can distribute the load better across more resources.</p>",
        "id": 553390437,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1762179087
    },
    {
        "content": "<p>The first step of <a href=\"https://solr.apache.org/guide/solr/latest/getting-started/tutorial-five-minutes.html\">https://solr.apache.org/guide/solr/latest/getting-started/tutorial-five-minutes.html</a> is to launch SolrCloud. Maybe we should get with the program and start using it. <span aria-label=\"grimacing\" class=\"emoji emoji-1f62c\" role=\"img\" title=\"grimacing\">:grimacing:</span></p>",
        "id": 553390641,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1762179147
    },
    {
        "content": "<p>You can even run single node SolrCloud instances. It uses an embedded ZooKeeper.</p>",
        "id": 553390796,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1762179183
    },
    {
        "content": "<p>Our current config files etc can stay as is.</p>",
        "id": 553390898,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1762179209
    },
    {
        "content": "<p>There is some room for improvement concerning routing of documents to shards. It would make sense to have files etc routed per datasetid, so queries happen on the same node.</p>",
        "id": 553391086,
        "sender_full_name": "Oliver Bertuch",
        "timestamp": 1762179259
    },
    {
        "content": "<p>Gotcha. Well, I guess I'm leaning to toward switching to SolrCloud.</p>",
        "id": 553391160,
        "sender_full_name": "Philip Durbin 🚀",
        "timestamp": 1762179282
    }
]