[
    {
        "content": "<p>Hello all,<br>\nFollowing the work on <a href=\"https://github.com/IQSS/dataverse/issues/10398\">#10398</a>,<br>\nWith my collegue <a href=\"https://github.com/Deschatres\">@Deschatres</a> have also listed the mandatory fields required by INSPIRE but missing from the existing table.<br>\nWe are working on a TSV file with elements we already implemented and suggestions for additions that we will share with you for discussion soon (spreadsheet).</p>\n<p>About source Quality Information: could someone tell me what “Georeferencing Information” is?</p>",
        "id": 478522538,
        "sender_full_name": "Dimitri Szabo",
        "timestamp": 1729696682
    },
    {
        "content": "<p>hi <span class=\"user-mention\" data-user-id=\"658065\">@Dimitri Szabo</span> I think this sort of stuff can go into a Georeferencing source quality field <a href=\"https://ocul.on.ca/topomaps/maps/map02/\">https://ocul.on.ca/topomaps/maps/map02/</a>  and <a href=\"https://geo.scholarsportal.info/#r/details/_uri@=HTDP63360K031D05_1928TIFF\">https://geo.scholarsportal.info/#r/details/_uri@=HTDP63360K031D05_1928TIFF</a> </p>\n<p>this kind of quality information e.g. <br>\n\"Print maps were digitized at 600 ppi resolution and 24-bit colour depth with Colortrac feed-through scanners (models SmartLF Gx+ T56 and SmartLF SG), using standardized colour normalization and stitch correction processes. Manual quality control methods were applied to each digitized sheet to ensure images were straightened and cropped appropriately. Images were also manually inspected for the presence of scanning artifacts; affected images were either corrected or the sheet was flagged for re-scanning.\" </p>\n<p>or georeferencing information e.g. \"A total of 8 to 12 ground control points (GCPs) were established for each digitized map using ArcMap software (versions 10.1 to 10.5). Georeferencing and projection for each map was carried out using the Geospatial Data Abstraction Library (GDAL) functions gdal_translate and gdalwarp, respectively. A custom script was used to automate the conversion of ArcMap GCP files to GDAL format, as well as the georeferencing and warping processes. As part of the warping process, GeoTIFFs were projected to the NAD83 datum, and into the appropriate UTM zone.\"</p>\n<p>Stuff like this I think needs a home. OGM / Geoblacklight folks are also interested in this mapping and enhanced geospatial metadata block project, so has connections to geoportals around the world that want to align standards and connect better with research data repositories --- curious and would LOVE to see your TSV file with elements from INSPIRE</p>\n<p>Best, <br>\nAmber</p>",
        "id": 478554045,
        "sender_full_name": "Amber Leahey",
        "timestamp": 1729706619
    }
]